konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : RVCSR
# Version        : 1
# Bus type       : apb
# Description    : CSR listing for Hazard3
# =============================================================================
.ifndef	_HARDWARE_REGS_RVCSR_H
.set	_HARDWARE_REGS_RVCSR_H, 1
# =============================================================================
# Register    : RVCSR_MSTATUS
# Description : Machine status register
.equ	RVCSR_MSTATUS_OFFSET, 0x00000300
.equ	RVCSR_MSTATUS_BITS, 0x00221888
.equ	RVCSR_MSTATUS_RESET, 0x00001800
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSTATUS_TW
# Description : Timeout wait. When 1, attempting to execute a WFI instruction
#               in U-mode will instantly cause an illegal instruction
#               exception.
.equ	RVCSR_MSTATUS_TW_RESET, 0x0
.equ	RVCSR_MSTATUS_TW_BITS, 0x00200000
.equ	RVCSR_MSTATUS_TW_MSB, 21
.equ	RVCSR_MSTATUS_TW_LSB, 21
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSTATUS_MPRV
# Description : Modify privilege. If 1, loads and stores behave as though the
#               current privilege level were `mpp`. This includes physical
#               memory protection checks, and the privilege level asserted on
#               the system bus alongside the load/store address.
.equ	RVCSR_MSTATUS_MPRV_RESET, 0x0
.equ	RVCSR_MSTATUS_MPRV_BITS, 0x00020000
.equ	RVCSR_MSTATUS_MPRV_MSB, 17
.equ	RVCSR_MSTATUS_MPRV_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSTATUS_MPP
# Description : Previous privilege level. Can store the values 3 (M-mode) or 0
#               (U-mode). If another value is written, hardware rounds to the
#               nearest supported mode.
.equ	RVCSR_MSTATUS_MPP_RESET, 0x3
.equ	RVCSR_MSTATUS_MPP_BITS, 0x00001800
.equ	RVCSR_MSTATUS_MPP_MSB, 12
.equ	RVCSR_MSTATUS_MPP_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSTATUS_MPIE
# Description : Previous interrupt enable. Readable and writable. Is set to the
#               current value of `mstatus.mie` on trap entry. Is set to 1 on
#               trap return.
.equ	RVCSR_MSTATUS_MPIE_RESET, 0x0
.equ	RVCSR_MSTATUS_MPIE_BITS, 0x00000080
.equ	RVCSR_MSTATUS_MPIE_MSB, 7
.equ	RVCSR_MSTATUS_MPIE_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSTATUS_MIE
# Description : Interrupt enable. Readable and writable. Is set to 0 on trap
#               entry. Is set to the current value of `mstatus.mpie` on trap
#               return.
.equ	RVCSR_MSTATUS_MIE_RESET, 0x0
.equ	RVCSR_MSTATUS_MIE_BITS, 0x00000008
.equ	RVCSR_MSTATUS_MIE_MSB, 3
.equ	RVCSR_MSTATUS_MIE_LSB, 3
# =============================================================================
# Register    : RVCSR_MISA
# Description : Summary of ISA extension support
#
#               On RP2350, Hazard3's full `-march` string is:
#               `rv32ima_zicsr_zifencei_zba_zbb_zbs_zbkb_zca_zcb_zcmp`
#
#               Note Zca is equivalent to the C extension in this case; all
#               instructions from the RISC-V C extension relevant to a 32-bit
#               non-floating-point processor are supported. On older toolchains
#               which do not support the Zc extensions, the appropriate
#               `-march` string is: `rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb`
#
#               In addition the following custom extensions are configured:
#               Xh3bm, Xh3power, Xh3irq, Xh3pmpm
.equ	RVCSR_MISA_OFFSET, 0x00000301
.equ	RVCSR_MISA_BITS, 0xc0901107
.equ	RVCSR_MISA_RESET, 0x40901105
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_MXL
# Description : Value of 0x1 indicates this is a 32-bit processor.
.equ	RVCSR_MISA_MXL_RESET, 0x1
.equ	RVCSR_MISA_MXL_BITS, 0xc0000000
.equ	RVCSR_MISA_MXL_MSB, 31
.equ	RVCSR_MISA_MXL_LSB, 30
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_X
# Description : Value of 1 indicates nonstandard extensions are present. (Xh3b
#               bit manipulation, and custom sleep and interrupt control CSRs)
.equ	RVCSR_MISA_X_RESET, 0x1
.equ	RVCSR_MISA_X_BITS, 0x00800000
.equ	RVCSR_MISA_X_MSB, 23
.equ	RVCSR_MISA_X_LSB, 23
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_U
# Description : Value of 1 indicates U-mode is implemented.
.equ	RVCSR_MISA_U_RESET, 0x1
.equ	RVCSR_MISA_U_BITS, 0x00100000
.equ	RVCSR_MISA_U_MSB, 20
.equ	RVCSR_MISA_U_LSB, 20
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_M
# Description : Value of 1 indicates the M extension (integer multiply/divide)
#               is implemented.
.equ	RVCSR_MISA_M_RESET, 0x1
.equ	RVCSR_MISA_M_BITS, 0x00001000
.equ	RVCSR_MISA_M_MSB, 12
.equ	RVCSR_MISA_M_LSB, 12
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_I
# Description : Value of 1 indicates the RVI base ISA is implemented (as
#               opposed to RVE)
.equ	RVCSR_MISA_I_RESET, 0x1
.equ	RVCSR_MISA_I_BITS, 0x00000100
.equ	RVCSR_MISA_I_MSB, 8
.equ	RVCSR_MISA_I_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_C
# Description : Value of 1 indicates the C extension (compressed instructions)
#               is implemented.
.equ	RVCSR_MISA_C_RESET, 0x1
.equ	RVCSR_MISA_C_BITS, 0x00000004
.equ	RVCSR_MISA_C_MSB, 2
.equ	RVCSR_MISA_C_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_B
# Description : Value of 1 indicates the B extension (bit manipulation) is
#               implemented. B is the combination of Zba, Zbb and Zbs.
#
#               Hazard3 implements all of these extensions, but the definition
#               of B as ZbaZbbZbs did not exist at the point this version of
#               Hazard3 was taped out. This bit was reserved-0 at that point.
#               Therefore this bit reads as 0.
.equ	RVCSR_MISA_B_RESET, 0x0
.equ	RVCSR_MISA_B_BITS, 0x00000002
.equ	RVCSR_MISA_B_MSB, 1
.equ	RVCSR_MISA_B_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_MISA_A
# Description : Value of 1 indicates the A extension (atomics) is implemented.
.equ	RVCSR_MISA_A_RESET, 0x1
.equ	RVCSR_MISA_A_BITS, 0x00000001
.equ	RVCSR_MISA_A_MSB, 0
.equ	RVCSR_MISA_A_LSB, 0
# =============================================================================
# Register    : RVCSR_MEDELEG
# Description : Machine exception delegation register. Not implemented, as no
#               S-mode support.
.equ	RVCSR_MEDELEG_OFFSET, 0x00000302
.equ	RVCSR_MEDELEG_BITS, 0xffffffff
.equ	RVCSR_MEDELEG_MSB, 31
.equ	RVCSR_MEDELEG_LSB, 0
# =============================================================================
# Register    : RVCSR_MIDELEG
# Description : Machine interrupt delegation register. Not implemented, as no
#               S-mode support.
.equ	RVCSR_MIDELEG_OFFSET, 0x00000303
.equ	RVCSR_MIDELEG_BITS, 0xffffffff
.equ	RVCSR_MIDELEG_MSB, 31
.equ	RVCSR_MIDELEG_LSB, 0
# =============================================================================
# Register    : RVCSR_MIE
# Description : Machine interrupt enable register
.equ	RVCSR_MIE_OFFSET, 0x00000304
.equ	RVCSR_MIE_BITS, 0x00000888
.equ	RVCSR_MIE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIE_MEIE
# Description : External interrupt enable. The processor transfers to the
#               external interrupt vector when `mie.meie`, `mip.meip` and
#               `mstatus.mie` are all 1.
#
#               Hazard3 has internal registers to individually filter external
#               interrupts (see `meiea`), but this standard control can be used
#               to mask all external interrupts at once.
.equ	RVCSR_MIE_MEIE_RESET, 0x0
.equ	RVCSR_MIE_MEIE_BITS, 0x00000800
.equ	RVCSR_MIE_MEIE_MSB, 11
.equ	RVCSR_MIE_MEIE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIE_MTIE
# Description : Timer interrupt enable. The processor transfers to the timer
#               interrupt vector when `mie.mtie`, `mip.mtip` and `mstatus.mie`
#               are all 1, unless a software or external interrupt request is
#               also valid at this time.
.equ	RVCSR_MIE_MTIE_RESET, 0x0
.equ	RVCSR_MIE_MTIE_BITS, 0x00000080
.equ	RVCSR_MIE_MTIE_MSB, 7
.equ	RVCSR_MIE_MTIE_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIE_MSIE
# Description : Software interrupt enable. The processor transfers to the
#               software interrupt vector `mie.msie`, `mip.msip` and
#               `mstatus.mie` are all 1, unless an external interrupt request
#               is also valid at this time.
.equ	RVCSR_MIE_MSIE_RESET, 0x0
.equ	RVCSR_MIE_MSIE_BITS, 0x00000008
.equ	RVCSR_MIE_MSIE_MSB, 3
.equ	RVCSR_MIE_MSIE_LSB, 3
# =============================================================================
# Register    : RVCSR_MTVEC
# Description : Machine trap handler base address.
.equ	RVCSR_MTVEC_OFFSET, 0x00000305
.equ	RVCSR_MTVEC_BITS, 0xffffffff
.equ	RVCSR_MTVEC_RESET, 0x00007ffc
# -----------------------------------------------------------------------------
# Field       : RVCSR_MTVEC_BASE
# Description : The upper 30 bits of the trap vector address (2 LSBs are
#               implicitly 0). Must be 64-byte-aligned if vectoring is enabled.
#               Otherwise, must be 4-byte-aligned.
.equ	RVCSR_MTVEC_BASE_RESET, 0x00001fff
.equ	RVCSR_MTVEC_BASE_BITS, 0xfffffffc
.equ	RVCSR_MTVEC_BASE_MSB, 31
.equ	RVCSR_MTVEC_BASE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MTVEC_MODE
# Description : If 0 (direct mode), all traps set pc to the trap vector base.
#               If 1 (vectored), exceptions set pc to the trap vector base, and
#               interrupts set pc to 4 times the interrupt cause (3=soft IRQ,
#               7=timer IRQ, 11=external IRQ).
#
#               The upper bit is hardwired to zero, so attempting to set mode
#               to 2 or 3 will result in a value of 0 or 1 respectively.
#               0x0 -> Direct entry to mtvec
#               0x1 -> Vectored entry to a 16-entry jump table starting at mtvec
.equ	RVCSR_MTVEC_MODE_RESET, 0x0
.equ	RVCSR_MTVEC_MODE_BITS, 0x00000003
.equ	RVCSR_MTVEC_MODE_MSB, 1
.equ	RVCSR_MTVEC_MODE_LSB, 0
.equ	RVCSR_MTVEC_MODE_VALUE_DIRECT, 0x0
.equ	RVCSR_MTVEC_MODE_VALUE_VECTORED, 0x1
# =============================================================================
# Register    : RVCSR_MCOUNTEREN
# Description : Counter enable. Control access to counters from U-mode. Not to
#               be confused with mcountinhibit.
.equ	RVCSR_MCOUNTEREN_OFFSET, 0x00000306
.equ	RVCSR_MCOUNTEREN_BITS, 0x00000007
.equ	RVCSR_MCOUNTEREN_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCOUNTEREN_IR
# Description : If 1, U-mode is permitted to access the `instret`/`instreth`
#               instruction retire counter CSRs. Otherwise, U-mode accesses to
#               these CSRs will trap.
.equ	RVCSR_MCOUNTEREN_IR_RESET, 0x0
.equ	RVCSR_MCOUNTEREN_IR_BITS, 0x00000004
.equ	RVCSR_MCOUNTEREN_IR_MSB, 2
.equ	RVCSR_MCOUNTEREN_IR_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCOUNTEREN_TM
# Description : No hardware effect, as the `time`/`timeh` CSRs are not
#               implemented. However, this field still exists, as M-mode
#               software can use it to track whether it should emulate U-mode
#               attempts to access those CSRs.
.equ	RVCSR_MCOUNTEREN_TM_RESET, 0x0
.equ	RVCSR_MCOUNTEREN_TM_BITS, 0x00000002
.equ	RVCSR_MCOUNTEREN_TM_MSB, 1
.equ	RVCSR_MCOUNTEREN_TM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCOUNTEREN_CY
# Description : If 1, U-mode is permitted to access the `cycle`/`cycleh` cycle
#               counter CSRs. Otherwise, U-mode accesses to these CSRs will
#               trap.
.equ	RVCSR_MCOUNTEREN_CY_RESET, 0x0
.equ	RVCSR_MCOUNTEREN_CY_BITS, 0x00000001
.equ	RVCSR_MCOUNTEREN_CY_MSB, 0
.equ	RVCSR_MCOUNTEREN_CY_LSB, 0
# =============================================================================
# Register    : RVCSR_MENVCFG
# Description : Machine environment configuration register, low half
.equ	RVCSR_MENVCFG_OFFSET, 0x0000030a
.equ	RVCSR_MENVCFG_BITS, 0x00000001
.equ	RVCSR_MENVCFG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MENVCFG_FIOM
# Description : When set, fence instructions in modes less privileged than
#               M-mode which specify that IO memory accesses are ordered will
#               also cause ordering of main memory accesses.
#
#               FIOM is hardwired to zero on Hazard3, because S-mode is not
#               supported, and because fence instructions execute as NOPs (with
#               the exception of `fence.i`)
.equ	RVCSR_MENVCFG_FIOM_RESET, 0x0
.equ	RVCSR_MENVCFG_FIOM_BITS, 0x00000001
.equ	RVCSR_MENVCFG_FIOM_MSB, 0
.equ	RVCSR_MENVCFG_FIOM_LSB, 0
# =============================================================================
# Register    : RVCSR_MSTATUSH
# Description : High half of mstatus, hardwired to 0.
.equ	RVCSR_MSTATUSH_OFFSET, 0x00000310
.equ	RVCSR_MSTATUSH_BITS, 0xffffffff
.equ	RVCSR_MSTATUSH_RESET, 0x00000000
.equ	RVCSR_MSTATUSH_MSB, 31
.equ	RVCSR_MSTATUSH_LSB, 0
# =============================================================================
# Register    : RVCSR_MENVCFGH
# Description : Machine environment configuration register, high half
#
#               This register is fully reserved, as Hazard3 does not implement
#               the relevant extensions. It is implemented as hardwired-0.
.equ	RVCSR_MENVCFGH_OFFSET, 0x0000031a
.equ	RVCSR_MENVCFGH_BITS, 0x00000000
.equ	RVCSR_MENVCFGH_RESET, 0x00000000
.equ	RVCSR_MENVCFGH_MSB, 31
.equ	RVCSR_MENVCFGH_LSB, 0
# =============================================================================
# Register    : RVCSR_MCOUNTINHIBIT
# Description : Count inhibit register for `mcycle`/`minstret`
.equ	RVCSR_MCOUNTINHIBIT_OFFSET, 0x00000320
.equ	RVCSR_MCOUNTINHIBIT_BITS, 0x00000005
.equ	RVCSR_MCOUNTINHIBIT_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCOUNTINHIBIT_IR
# Description : Inhibit counting of the `minstret` and `minstreth` registers.
#               Set by default to save power.
.equ	RVCSR_MCOUNTINHIBIT_IR_RESET, 0x1
.equ	RVCSR_MCOUNTINHIBIT_IR_BITS, 0x00000004
.equ	RVCSR_MCOUNTINHIBIT_IR_MSB, 2
.equ	RVCSR_MCOUNTINHIBIT_IR_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCOUNTINHIBIT_CY
# Description : Inhibit counting of the `mcycle` and `mcycleh` registers. Set
#               by default to save power.
.equ	RVCSR_MCOUNTINHIBIT_CY_RESET, 0x1
.equ	RVCSR_MCOUNTINHIBIT_CY_BITS, 0x00000001
.equ	RVCSR_MCOUNTINHIBIT_CY_MSB, 0
.equ	RVCSR_MCOUNTINHIBIT_CY_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT3
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT3_OFFSET, 0x00000323
.equ	RVCSR_MHPMEVENT3_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT3_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT3_MSB, 31
.equ	RVCSR_MHPMEVENT3_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT4
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT4_OFFSET, 0x00000324
.equ	RVCSR_MHPMEVENT4_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT4_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT4_MSB, 31
.equ	RVCSR_MHPMEVENT4_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT5
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT5_OFFSET, 0x00000325
.equ	RVCSR_MHPMEVENT5_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT5_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT5_MSB, 31
.equ	RVCSR_MHPMEVENT5_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT6
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT6_OFFSET, 0x00000326
.equ	RVCSR_MHPMEVENT6_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT6_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT6_MSB, 31
.equ	RVCSR_MHPMEVENT6_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT7
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT7_OFFSET, 0x00000327
.equ	RVCSR_MHPMEVENT7_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT7_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT7_MSB, 31
.equ	RVCSR_MHPMEVENT7_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT8
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT8_OFFSET, 0x00000328
.equ	RVCSR_MHPMEVENT8_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT8_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT8_MSB, 31
.equ	RVCSR_MHPMEVENT8_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT9
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT9_OFFSET, 0x00000329
.equ	RVCSR_MHPMEVENT9_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT9_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT9_MSB, 31
.equ	RVCSR_MHPMEVENT9_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT10
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT10_OFFSET, 0x0000032a
.equ	RVCSR_MHPMEVENT10_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT10_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT10_MSB, 31
.equ	RVCSR_MHPMEVENT10_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT11
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT11_OFFSET, 0x0000032b
.equ	RVCSR_MHPMEVENT11_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT11_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT11_MSB, 31
.equ	RVCSR_MHPMEVENT11_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT12
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT12_OFFSET, 0x0000032c
.equ	RVCSR_MHPMEVENT12_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT12_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT12_MSB, 31
.equ	RVCSR_MHPMEVENT12_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT13
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT13_OFFSET, 0x0000032d
.equ	RVCSR_MHPMEVENT13_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT13_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT13_MSB, 31
.equ	RVCSR_MHPMEVENT13_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT14
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT14_OFFSET, 0x0000032e
.equ	RVCSR_MHPMEVENT14_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT14_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT14_MSB, 31
.equ	RVCSR_MHPMEVENT14_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT15
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT15_OFFSET, 0x0000032f
.equ	RVCSR_MHPMEVENT15_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT15_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT15_MSB, 31
.equ	RVCSR_MHPMEVENT15_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT16
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT16_OFFSET, 0x00000330
.equ	RVCSR_MHPMEVENT16_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT16_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT16_MSB, 31
.equ	RVCSR_MHPMEVENT16_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT17
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT17_OFFSET, 0x00000331
.equ	RVCSR_MHPMEVENT17_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT17_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT17_MSB, 31
.equ	RVCSR_MHPMEVENT17_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT18
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT18_OFFSET, 0x00000332
.equ	RVCSR_MHPMEVENT18_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT18_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT18_MSB, 31
.equ	RVCSR_MHPMEVENT18_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT19
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT19_OFFSET, 0x00000333
.equ	RVCSR_MHPMEVENT19_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT19_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT19_MSB, 31
.equ	RVCSR_MHPMEVENT19_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT20
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT20_OFFSET, 0x00000334
.equ	RVCSR_MHPMEVENT20_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT20_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT20_MSB, 31
.equ	RVCSR_MHPMEVENT20_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT21
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT21_OFFSET, 0x00000335
.equ	RVCSR_MHPMEVENT21_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT21_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT21_MSB, 31
.equ	RVCSR_MHPMEVENT21_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT22
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT22_OFFSET, 0x00000336
.equ	RVCSR_MHPMEVENT22_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT22_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT22_MSB, 31
.equ	RVCSR_MHPMEVENT22_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT23
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT23_OFFSET, 0x00000337
.equ	RVCSR_MHPMEVENT23_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT23_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT23_MSB, 31
.equ	RVCSR_MHPMEVENT23_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT24
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT24_OFFSET, 0x00000338
.equ	RVCSR_MHPMEVENT24_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT24_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT24_MSB, 31
.equ	RVCSR_MHPMEVENT24_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT25
