konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT25_OFFSET, 0x00000339
.equ	RVCSR_MHPMEVENT25_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT25_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT25_MSB, 31
.equ	RVCSR_MHPMEVENT25_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT26
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT26_OFFSET, 0x0000033a
.equ	RVCSR_MHPMEVENT26_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT26_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT26_MSB, 31
.equ	RVCSR_MHPMEVENT26_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT27
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT27_OFFSET, 0x0000033b
.equ	RVCSR_MHPMEVENT27_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT27_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT27_MSB, 31
.equ	RVCSR_MHPMEVENT27_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT28
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT28_OFFSET, 0x0000033c
.equ	RVCSR_MHPMEVENT28_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT28_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT28_MSB, 31
.equ	RVCSR_MHPMEVENT28_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT29
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT29_OFFSET, 0x0000033d
.equ	RVCSR_MHPMEVENT29_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT29_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT29_MSB, 31
.equ	RVCSR_MHPMEVENT29_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT30
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT30_OFFSET, 0x0000033e
.equ	RVCSR_MHPMEVENT30_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT30_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT30_MSB, 31
.equ	RVCSR_MHPMEVENT30_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMEVENT31
# Description : Extended performance event selector, hardwired to 0.
.equ	RVCSR_MHPMEVENT31_OFFSET, 0x0000033f
.equ	RVCSR_MHPMEVENT31_BITS, 0xffffffff
.equ	RVCSR_MHPMEVENT31_RESET, 0x00000000
.equ	RVCSR_MHPMEVENT31_MSB, 31
.equ	RVCSR_MHPMEVENT31_LSB, 0
# =============================================================================
# Register    : RVCSR_MSCRATCH
# Description : Scratch register for machine trap handlers.
#
#               32-bit read/write register with no specific hardware function.
#               Software may use this to do a fast save/restore of a core
#               register in a trap handler.
.equ	RVCSR_MSCRATCH_OFFSET, 0x00000340
.equ	RVCSR_MSCRATCH_BITS, 0xffffffff
.equ	RVCSR_MSCRATCH_RESET, 0x00000000
.equ	RVCSR_MSCRATCH_MSB, 31
.equ	RVCSR_MSCRATCH_LSB, 0
# =============================================================================
# Register    : RVCSR_MEPC
# Description : Machine exception program counter.
#
#               When entering a trap, the current value of the program counter
#               is recorded here. When executing an `mret`, the processor jumps
#               to `mepc`. Can also be read and written by software.
.equ	RVCSR_MEPC_OFFSET, 0x00000341
.equ	RVCSR_MEPC_BITS, 0xfffffffc
.equ	RVCSR_MEPC_RESET, 0x00000000
.equ	RVCSR_MEPC_MSB, 31
.equ	RVCSR_MEPC_LSB, 2
# =============================================================================
# Register    : RVCSR_MCAUSE
# Description : Machine trap cause. Set when entering a trap to indicate the
#               reason for the trap. Readable and writable by software.
.equ	RVCSR_MCAUSE_OFFSET, 0x00000342
.equ	RVCSR_MCAUSE_BITS, 0x8000000f
.equ	RVCSR_MCAUSE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCAUSE_INTERRUPT
# Description : If 1, the trap was caused by an interrupt. If 0, it was caused
#               by an exception.
.equ	RVCSR_MCAUSE_INTERRUPT_RESET, 0x0
.equ	RVCSR_MCAUSE_INTERRUPT_BITS, 0x80000000
.equ	RVCSR_MCAUSE_INTERRUPT_MSB, 31
.equ	RVCSR_MCAUSE_INTERRUPT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_MCAUSE_CODE
# Description : If `interrupt` is set, `code` indicates the index of the bit in
#               mip that caused the trap (3=soft IRQ, 7=timer IRQ, 11=external
#               IRQ). Otherwise, `code` is set according to the cause of the
#               exception.
#               0x0 -> Instruction fetch was misaligned. Will never fire on RP2350, since the C extension is enabled.
#               0x1 -> Instruction access fault. Instruction fetch failed a PMP check, or encountered a downstream bus fault, and then passed the point of no speculation.
#               0x2 -> Illegal instruction was executed (including illegal CSR accesses)
#               0x3 -> Breakpoint. An ebreak instruction was executed when the relevant dcsr.ebreak bit was clear.
#               0x4 -> Load address misaligned. Hazard3 requires natural alignment of all accesses.
#               0x5 -> Load access fault. A load failed a PMP check, or encountered a downstream bus error.
#               0x6 -> Store/AMO address misaligned. Hazard3 requires natural alignment of all accesses.
#               0x7 -> Store/AMO access fault. A store/AMO failed a PMP check, or encountered a downstream bus error. Also set if an AMO is attempted on a region that does not support atomics (on RP2350, anything but SRAM).
#               0x8 -> Environment call from U-mode.
#               0xb -> Environment call from M-mode.
.equ	RVCSR_MCAUSE_CODE_RESET, 0x0
.equ	RVCSR_MCAUSE_CODE_BITS, 0x0000000f
.equ	RVCSR_MCAUSE_CODE_MSB, 3
.equ	RVCSR_MCAUSE_CODE_LSB, 0
.equ	RVCSR_MCAUSE_CODE_VALUE_INSTR_ALIGN, 0x0
.equ	RVCSR_MCAUSE_CODE_VALUE_INSTR_FAULT, 0x1
.equ	RVCSR_MCAUSE_CODE_VALUE_ILLEGAL_INSTR, 0x2
.equ	RVCSR_MCAUSE_CODE_VALUE_BREAKPOINT, 0x3
.equ	RVCSR_MCAUSE_CODE_VALUE_LOAD_ALIGN, 0x4
.equ	RVCSR_MCAUSE_CODE_VALUE_LOAD_FAULT, 0x5
.equ	RVCSR_MCAUSE_CODE_VALUE_STORE_ALIGN, 0x6
.equ	RVCSR_MCAUSE_CODE_VALUE_STORE_FAULT, 0x7
.equ	RVCSR_MCAUSE_CODE_VALUE_U_ECALL, 0x8
.equ	RVCSR_MCAUSE_CODE_VALUE_M_ECALL, 0xb
# =============================================================================
# Register    : RVCSR_MTVAL
# Description : Machine bad address or instruction. Hardwired to zero.
.equ	RVCSR_MTVAL_OFFSET, 0x00000343
.equ	RVCSR_MTVAL_BITS, 0xffffffff
.equ	RVCSR_MTVAL_RESET, 0x00000000
.equ	RVCSR_MTVAL_MSB, 31
.equ	RVCSR_MTVAL_LSB, 0
# =============================================================================
# Register    : RVCSR_MIP
# Description : Machine interrupt pending
.equ	RVCSR_MIP_OFFSET, 0x00000344
.equ	RVCSR_MIP_BITS, 0x00000888
.equ	RVCSR_MIP_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIP_MEIP
# Description : External interrupt pending. The processor transfers to the
#               external interrupt vector when `mie.meie`, `mip.meip` and
#               `mstatus.mie` are all 1.
#
#               Hazard3 has internal registers to individually filter which
#               external IRQs appear in `meip`. When `meip` is 1, this
#               indicates there is at least one external interrupt which is
#               asserted (hence pending in `mieipa`), enabled in `meiea`, and
#               of priority greater than or equal to the current preemption
#               level in `meicontext.preempt`.
.equ	RVCSR_MIP_MEIP_RESET, 0x0
.equ	RVCSR_MIP_MEIP_BITS, 0x00000800
.equ	RVCSR_MIP_MEIP_MSB, 11
.equ	RVCSR_MIP_MEIP_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIP_MTIP
# Description : Timer interrupt pending. The processor transfers to the timer
#               interrupt vector when `mie.mtie`, `mip.mtip` and `mstatus.mie`
#               are all 1, unless a software or external interrupt request is
#               also valid at this time.
.equ	RVCSR_MIP_MTIP_RESET, 0x0
.equ	RVCSR_MIP_MTIP_BITS, 0x00000080
.equ	RVCSR_MIP_MTIP_MSB, 7
.equ	RVCSR_MIP_MTIP_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_MIP_MSIP
# Description : Software interrupt pending. The processor transfers to the
#               software interrupt vector `mie.msie`, `mip.msip` and
#               `mstatus.mie` are all 1, unless an external interrupt request
#               is also valid at this time.
.equ	RVCSR_MIP_MSIP_RESET, 0x0
.equ	RVCSR_MIP_MSIP_BITS, 0x00000008
.equ	RVCSR_MIP_MSIP_MSB, 3
.equ	RVCSR_MIP_MSIP_LSB, 3
# =============================================================================
# Register    : RVCSR_PMPCFG0
# Description : Physical memory protection configuration for regions 0 through
#               3
.equ	RVCSR_PMPCFG0_OFFSET, 0x000003a0
.equ	RVCSR_PMPCFG0_BITS, 0x9f9f9f9f
.equ	RVCSR_PMPCFG0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R3_L
# Description : Lock region 3, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG0_R3_L_RESET, 0x0
.equ	RVCSR_PMPCFG0_R3_L_BITS, 0x80000000
.equ	RVCSR_PMPCFG0_R3_L_MSB, 31
.equ	RVCSR_PMPCFG0_R3_L_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R3_A
# Description : Address matching type for region 3. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG0_R3_A_RESET, 0x0
.equ	RVCSR_PMPCFG0_R3_A_BITS, 0x18000000
.equ	RVCSR_PMPCFG0_R3_A_MSB, 28
.equ	RVCSR_PMPCFG0_R3_A_LSB, 27
.equ	RVCSR_PMPCFG0_R3_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG0_R3_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG0_R3_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R3_R
# Description : Read permission for region 3. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R3_R_RESET, 0x0
.equ	RVCSR_PMPCFG0_R3_R_BITS, 0x04000000
.equ	RVCSR_PMPCFG0_R3_R_MSB, 26
.equ	RVCSR_PMPCFG0_R3_R_LSB, 26
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R3_W
# Description : Write permission for region 3
.equ	RVCSR_PMPCFG0_R3_W_RESET, 0x0
.equ	RVCSR_PMPCFG0_R3_W_BITS, 0x02000000
.equ	RVCSR_PMPCFG0_R3_W_MSB, 25
.equ	RVCSR_PMPCFG0_R3_W_LSB, 25
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R3_X
# Description : Execute permission for region 3. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R3_X_RESET, 0x0
.equ	RVCSR_PMPCFG0_R3_X_BITS, 0x01000000
.equ	RVCSR_PMPCFG0_R3_X_MSB, 24
.equ	RVCSR_PMPCFG0_R3_X_LSB, 24
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R2_L
# Description : Lock region 2, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG0_R2_L_RESET, 0x0
.equ	RVCSR_PMPCFG0_R2_L_BITS, 0x00800000
.equ	RVCSR_PMPCFG0_R2_L_MSB, 23
.equ	RVCSR_PMPCFG0_R2_L_LSB, 23
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R2_A
# Description : Address matching type for region 2. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG0_R2_A_RESET, 0x0
.equ	RVCSR_PMPCFG0_R2_A_BITS, 0x00180000
.equ	RVCSR_PMPCFG0_R2_A_MSB, 20
.equ	RVCSR_PMPCFG0_R2_A_LSB, 19
.equ	RVCSR_PMPCFG0_R2_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG0_R2_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG0_R2_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R2_R
# Description : Read permission for region 2. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R2_R_RESET, 0x0
.equ	RVCSR_PMPCFG0_R2_R_BITS, 0x00040000
.equ	RVCSR_PMPCFG0_R2_R_MSB, 18
.equ	RVCSR_PMPCFG0_R2_R_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R2_W
# Description : Write permission for region 2
.equ	RVCSR_PMPCFG0_R2_W_RESET, 0x0
.equ	RVCSR_PMPCFG0_R2_W_BITS, 0x00020000
.equ	RVCSR_PMPCFG0_R2_W_MSB, 17
.equ	RVCSR_PMPCFG0_R2_W_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R2_X
# Description : Execute permission for region 2. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R2_X_RESET, 0x0
.equ	RVCSR_PMPCFG0_R2_X_BITS, 0x00010000
.equ	RVCSR_PMPCFG0_R2_X_MSB, 16
.equ	RVCSR_PMPCFG0_R2_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R1_L
# Description : Lock region 1, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG0_R1_L_RESET, 0x0
.equ	RVCSR_PMPCFG0_R1_L_BITS, 0x00008000
.equ	RVCSR_PMPCFG0_R1_L_MSB, 15
.equ	RVCSR_PMPCFG0_R1_L_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R1_A
# Description : Address matching type for region 1. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG0_R1_A_RESET, 0x0
.equ	RVCSR_PMPCFG0_R1_A_BITS, 0x00001800
.equ	RVCSR_PMPCFG0_R1_A_MSB, 12
.equ	RVCSR_PMPCFG0_R1_A_LSB, 11
.equ	RVCSR_PMPCFG0_R1_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG0_R1_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG0_R1_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R1_R
# Description : Read permission for region 1. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R1_R_RESET, 0x0
.equ	RVCSR_PMPCFG0_R1_R_BITS, 0x00000400
.equ	RVCSR_PMPCFG0_R1_R_MSB, 10
.equ	RVCSR_PMPCFG0_R1_R_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R1_W
# Description : Write permission for region 1
.equ	RVCSR_PMPCFG0_R1_W_RESET, 0x0
.equ	RVCSR_PMPCFG0_R1_W_BITS, 0x00000200
.equ	RVCSR_PMPCFG0_R1_W_MSB, 9
.equ	RVCSR_PMPCFG0_R1_W_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R1_X
# Description : Execute permission for region 1. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R1_X_RESET, 0x0
.equ	RVCSR_PMPCFG0_R1_X_BITS, 0x00000100
.equ	RVCSR_PMPCFG0_R1_X_MSB, 8
.equ	RVCSR_PMPCFG0_R1_X_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R0_L
# Description : Lock region 0, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG0_R0_L_RESET, 0x0
.equ	RVCSR_PMPCFG0_R0_L_BITS, 0x00000080
.equ	RVCSR_PMPCFG0_R0_L_MSB, 7
.equ	RVCSR_PMPCFG0_R0_L_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R0_A
# Description : Address matching type for region 0. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG0_R0_A_RESET, 0x0
.equ	RVCSR_PMPCFG0_R0_A_BITS, 0x00000018
.equ	RVCSR_PMPCFG0_R0_A_MSB, 4
.equ	RVCSR_PMPCFG0_R0_A_LSB, 3
.equ	RVCSR_PMPCFG0_R0_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG0_R0_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG0_R0_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R0_R
# Description : Read permission for region 0. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R0_R_RESET, 0x0
.equ	RVCSR_PMPCFG0_R0_R_BITS, 0x00000004
.equ	RVCSR_PMPCFG0_R0_R_MSB, 2
.equ	RVCSR_PMPCFG0_R0_R_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R0_W
# Description : Write permission for region 0
.equ	RVCSR_PMPCFG0_R0_W_RESET, 0x0
.equ	RVCSR_PMPCFG0_R0_W_BITS, 0x00000002
.equ	RVCSR_PMPCFG0_R0_W_MSB, 1
.equ	RVCSR_PMPCFG0_R0_W_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG0_R0_X
# Description : Execute permission for region 0. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG0_R0_X_RESET, 0x0
.equ	RVCSR_PMPCFG0_R0_X_BITS, 0x00000001
.equ	RVCSR_PMPCFG0_R0_X_MSB, 0
.equ	RVCSR_PMPCFG0_R0_X_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPCFG1
# Description : Physical memory protection configuration for regions 4 through
#               7
.equ	RVCSR_PMPCFG1_OFFSET, 0x000003a1
.equ	RVCSR_PMPCFG1_BITS, 0x9f9f9f9f
.equ	RVCSR_PMPCFG1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R7_L
# Description : Lock region 7, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG1_R7_L_RESET, 0x0
.equ	RVCSR_PMPCFG1_R7_L_BITS, 0x80000000
.equ	RVCSR_PMPCFG1_R7_L_MSB, 31
.equ	RVCSR_PMPCFG1_R7_L_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R7_A
# Description : Address matching type for region 7. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG1_R7_A_RESET, 0x0
.equ	RVCSR_PMPCFG1_R7_A_BITS, 0x18000000
.equ	RVCSR_PMPCFG1_R7_A_MSB, 28
.equ	RVCSR_PMPCFG1_R7_A_LSB, 27
.equ	RVCSR_PMPCFG1_R7_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG1_R7_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG1_R7_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R7_R
# Description : Read permission for region 7. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R7_R_RESET, 0x0
.equ	RVCSR_PMPCFG1_R7_R_BITS, 0x04000000
.equ	RVCSR_PMPCFG1_R7_R_MSB, 26
.equ	RVCSR_PMPCFG1_R7_R_LSB, 26
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R7_W
# Description : Write permission for region 7
.equ	RVCSR_PMPCFG1_R7_W_RESET, 0x0
.equ	RVCSR_PMPCFG1_R7_W_BITS, 0x02000000
.equ	RVCSR_PMPCFG1_R7_W_MSB, 25
.equ	RVCSR_PMPCFG1_R7_W_LSB, 25
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R7_X
# Description : Execute permission for region 7. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R7_X_RESET, 0x0
.equ	RVCSR_PMPCFG1_R7_X_BITS, 0x01000000
.equ	RVCSR_PMPCFG1_R7_X_MSB, 24
.equ	RVCSR_PMPCFG1_R7_X_LSB, 24
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R6_L
# Description : Lock region 6, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG1_R6_L_RESET, 0x0
.equ	RVCSR_PMPCFG1_R6_L_BITS, 0x00800000
.equ	RVCSR_PMPCFG1_R6_L_MSB, 23
.equ	RVCSR_PMPCFG1_R6_L_LSB, 23
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R6_A
# Description : Address matching type for region 6. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG1_R6_A_RESET, 0x0
.equ	RVCSR_PMPCFG1_R6_A_BITS, 0x00180000
.equ	RVCSR_PMPCFG1_R6_A_MSB, 20
.equ	RVCSR_PMPCFG1_R6_A_LSB, 19
.equ	RVCSR_PMPCFG1_R6_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG1_R6_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG1_R6_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R6_R
# Description : Read permission for region 6. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R6_R_RESET, 0x0
.equ	RVCSR_PMPCFG1_R6_R_BITS, 0x00040000
.equ	RVCSR_PMPCFG1_R6_R_MSB, 18
.equ	RVCSR_PMPCFG1_R6_R_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R6_W
# Description : Write permission for region 6
.equ	RVCSR_PMPCFG1_R6_W_RESET, 0x0
.equ	RVCSR_PMPCFG1_R6_W_BITS, 0x00020000
.equ	RVCSR_PMPCFG1_R6_W_MSB, 17
.equ	RVCSR_PMPCFG1_R6_W_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R6_X
# Description : Execute permission for region 6. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R6_X_RESET, 0x0
.equ	RVCSR_PMPCFG1_R6_X_BITS, 0x00010000
.equ	RVCSR_PMPCFG1_R6_X_MSB, 16
.equ	RVCSR_PMPCFG1_R6_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R5_L
# Description : Lock region 5, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG1_R5_L_RESET, 0x0
.equ	RVCSR_PMPCFG1_R5_L_BITS, 0x00008000
.equ	RVCSR_PMPCFG1_R5_L_MSB, 15
.equ	RVCSR_PMPCFG1_R5_L_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R5_A
# Description : Address matching type for region 5. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG1_R5_A_RESET, 0x0
.equ	RVCSR_PMPCFG1_R5_A_BITS, 0x00001800
.equ	RVCSR_PMPCFG1_R5_A_MSB, 12
.equ	RVCSR_PMPCFG1_R5_A_LSB, 11
.equ	RVCSR_PMPCFG1_R5_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG1_R5_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG1_R5_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R5_R
# Description : Read permission for region 5. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R5_R_RESET, 0x0
.equ	RVCSR_PMPCFG1_R5_R_BITS, 0x00000400
.equ	RVCSR_PMPCFG1_R5_R_MSB, 10
.equ	RVCSR_PMPCFG1_R5_R_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R5_W
# Description : Write permission for region 5
.equ	RVCSR_PMPCFG1_R5_W_RESET, 0x0
.equ	RVCSR_PMPCFG1_R5_W_BITS, 0x00000200
.equ	RVCSR_PMPCFG1_R5_W_MSB, 9
.equ	RVCSR_PMPCFG1_R5_W_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R5_X
# Description : Execute permission for region 5. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R5_X_RESET, 0x0
