konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
.equ	RVCSR_PMPCFG1_R5_X_BITS, 0x00000100
.equ	RVCSR_PMPCFG1_R5_X_MSB, 8
.equ	RVCSR_PMPCFG1_R5_X_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R4_L
# Description : Lock region 4, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG1_R4_L_RESET, 0x0
.equ	RVCSR_PMPCFG1_R4_L_BITS, 0x00000080
.equ	RVCSR_PMPCFG1_R4_L_MSB, 7
.equ	RVCSR_PMPCFG1_R4_L_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R4_A
# Description : Address matching type for region 4. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG1_R4_A_RESET, 0x0
.equ	RVCSR_PMPCFG1_R4_A_BITS, 0x00000018
.equ	RVCSR_PMPCFG1_R4_A_MSB, 4
.equ	RVCSR_PMPCFG1_R4_A_LSB, 3
.equ	RVCSR_PMPCFG1_R4_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG1_R4_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG1_R4_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R4_R
# Description : Read permission for region 4. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R4_R_RESET, 0x0
.equ	RVCSR_PMPCFG1_R4_R_BITS, 0x00000004
.equ	RVCSR_PMPCFG1_R4_R_MSB, 2
.equ	RVCSR_PMPCFG1_R4_R_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R4_W
# Description : Write permission for region 4
.equ	RVCSR_PMPCFG1_R4_W_RESET, 0x0
.equ	RVCSR_PMPCFG1_R4_W_BITS, 0x00000002
.equ	RVCSR_PMPCFG1_R4_W_MSB, 1
.equ	RVCSR_PMPCFG1_R4_W_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG1_R4_X
# Description : Execute permission for region 4. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG1_R4_X_RESET, 0x0
.equ	RVCSR_PMPCFG1_R4_X_BITS, 0x00000001
.equ	RVCSR_PMPCFG1_R4_X_MSB, 0
.equ	RVCSR_PMPCFG1_R4_X_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPCFG2
# Description : Physical memory protection configuration for regions 8 through
#               11
.equ	RVCSR_PMPCFG2_OFFSET, 0x000003a2
.equ	RVCSR_PMPCFG2_BITS, 0x9f9f9f9f
.equ	RVCSR_PMPCFG2_RESET, 0x001f1f1f
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R11_L
# Description : Lock region 11, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG2_R11_L_RESET, 0x0
.equ	RVCSR_PMPCFG2_R11_L_BITS, 0x80000000
.equ	RVCSR_PMPCFG2_R11_L_MSB, 31
.equ	RVCSR_PMPCFG2_R11_L_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R11_A
# Description : Address matching type for region 11. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG2_R11_A_RESET, 0x0
.equ	RVCSR_PMPCFG2_R11_A_BITS, 0x18000000
.equ	RVCSR_PMPCFG2_R11_A_MSB, 28
.equ	RVCSR_PMPCFG2_R11_A_LSB, 27
.equ	RVCSR_PMPCFG2_R11_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG2_R11_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG2_R11_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R11_R
# Description : Read permission for region 11. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R11_R_RESET, 0x0
.equ	RVCSR_PMPCFG2_R11_R_BITS, 0x04000000
.equ	RVCSR_PMPCFG2_R11_R_MSB, 26
.equ	RVCSR_PMPCFG2_R11_R_LSB, 26
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R11_W
# Description : Write permission for region 11
.equ	RVCSR_PMPCFG2_R11_W_RESET, 0x0
.equ	RVCSR_PMPCFG2_R11_W_BITS, 0x02000000
.equ	RVCSR_PMPCFG2_R11_W_MSB, 25
.equ	RVCSR_PMPCFG2_R11_W_LSB, 25
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R11_X
# Description : Execute permission for region 11. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R11_X_RESET, 0x0
.equ	RVCSR_PMPCFG2_R11_X_BITS, 0x01000000
.equ	RVCSR_PMPCFG2_R11_X_MSB, 24
.equ	RVCSR_PMPCFG2_R11_X_LSB, 24
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R10_L
# Description : Lock region 10, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG2_R10_L_RESET, 0x0
.equ	RVCSR_PMPCFG2_R10_L_BITS, 0x00800000
.equ	RVCSR_PMPCFG2_R10_L_MSB, 23
.equ	RVCSR_PMPCFG2_R10_L_LSB, 23
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R10_A
# Description : Address matching type for region 10. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG2_R10_A_RESET, 0x3
.equ	RVCSR_PMPCFG2_R10_A_BITS, 0x00180000
.equ	RVCSR_PMPCFG2_R10_A_MSB, 20
.equ	RVCSR_PMPCFG2_R10_A_LSB, 19
.equ	RVCSR_PMPCFG2_R10_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG2_R10_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG2_R10_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R10_R
# Description : Read permission for region 10. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R10_R_RESET, 0x1
.equ	RVCSR_PMPCFG2_R10_R_BITS, 0x00040000
.equ	RVCSR_PMPCFG2_R10_R_MSB, 18
.equ	RVCSR_PMPCFG2_R10_R_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R10_W
# Description : Write permission for region 10
.equ	RVCSR_PMPCFG2_R10_W_RESET, 0x1
.equ	RVCSR_PMPCFG2_R10_W_BITS, 0x00020000
.equ	RVCSR_PMPCFG2_R10_W_MSB, 17
.equ	RVCSR_PMPCFG2_R10_W_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R10_X
# Description : Execute permission for region 10. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R10_X_RESET, 0x1
.equ	RVCSR_PMPCFG2_R10_X_BITS, 0x00010000
.equ	RVCSR_PMPCFG2_R10_X_MSB, 16
.equ	RVCSR_PMPCFG2_R10_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R9_L
# Description : Lock region 9, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG2_R9_L_RESET, 0x0
.equ	RVCSR_PMPCFG2_R9_L_BITS, 0x00008000
.equ	RVCSR_PMPCFG2_R9_L_MSB, 15
.equ	RVCSR_PMPCFG2_R9_L_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R9_A
# Description : Address matching type for region 9. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG2_R9_A_RESET, 0x3
.equ	RVCSR_PMPCFG2_R9_A_BITS, 0x00001800
.equ	RVCSR_PMPCFG2_R9_A_MSB, 12
.equ	RVCSR_PMPCFG2_R9_A_LSB, 11
.equ	RVCSR_PMPCFG2_R9_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG2_R9_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG2_R9_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R9_R
# Description : Read permission for region 9. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R9_R_RESET, 0x1
.equ	RVCSR_PMPCFG2_R9_R_BITS, 0x00000400
.equ	RVCSR_PMPCFG2_R9_R_MSB, 10
.equ	RVCSR_PMPCFG2_R9_R_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R9_W
# Description : Write permission for region 9
.equ	RVCSR_PMPCFG2_R9_W_RESET, 0x1
.equ	RVCSR_PMPCFG2_R9_W_BITS, 0x00000200
.equ	RVCSR_PMPCFG2_R9_W_MSB, 9
.equ	RVCSR_PMPCFG2_R9_W_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R9_X
# Description : Execute permission for region 9. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R9_X_RESET, 0x1
.equ	RVCSR_PMPCFG2_R9_X_BITS, 0x00000100
.equ	RVCSR_PMPCFG2_R9_X_MSB, 8
.equ	RVCSR_PMPCFG2_R9_X_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R8_L
# Description : Lock region 8, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG2_R8_L_RESET, 0x0
.equ	RVCSR_PMPCFG2_R8_L_BITS, 0x00000080
.equ	RVCSR_PMPCFG2_R8_L_MSB, 7
.equ	RVCSR_PMPCFG2_R8_L_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R8_A
# Description : Address matching type for region 8. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG2_R8_A_RESET, 0x3
.equ	RVCSR_PMPCFG2_R8_A_BITS, 0x00000018
.equ	RVCSR_PMPCFG2_R8_A_MSB, 4
.equ	RVCSR_PMPCFG2_R8_A_LSB, 3
.equ	RVCSR_PMPCFG2_R8_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG2_R8_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG2_R8_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R8_R
# Description : Read permission for region 8. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R8_R_RESET, 0x1
.equ	RVCSR_PMPCFG2_R8_R_BITS, 0x00000004
.equ	RVCSR_PMPCFG2_R8_R_MSB, 2
.equ	RVCSR_PMPCFG2_R8_R_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R8_W
# Description : Write permission for region 8
.equ	RVCSR_PMPCFG2_R8_W_RESET, 0x1
.equ	RVCSR_PMPCFG2_R8_W_BITS, 0x00000002
.equ	RVCSR_PMPCFG2_R8_W_MSB, 1
.equ	RVCSR_PMPCFG2_R8_W_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG2_R8_X
# Description : Execute permission for region 8. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG2_R8_X_RESET, 0x1
.equ	RVCSR_PMPCFG2_R8_X_BITS, 0x00000001
.equ	RVCSR_PMPCFG2_R8_X_MSB, 0
.equ	RVCSR_PMPCFG2_R8_X_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPCFG3
# Description : Physical memory protection configuration for regions 12 through
#               15
.equ	RVCSR_PMPCFG3_OFFSET, 0x000003a3
.equ	RVCSR_PMPCFG3_BITS, 0x9f9f9f9f
.equ	RVCSR_PMPCFG3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R15_L
# Description : Lock region 15, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG3_R15_L_RESET, 0x0
.equ	RVCSR_PMPCFG3_R15_L_BITS, 0x80000000
.equ	RVCSR_PMPCFG3_R15_L_MSB, 31
.equ	RVCSR_PMPCFG3_R15_L_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R15_A
# Description : Address matching type for region 15. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG3_R15_A_RESET, 0x0
.equ	RVCSR_PMPCFG3_R15_A_BITS, 0x18000000
.equ	RVCSR_PMPCFG3_R15_A_MSB, 28
.equ	RVCSR_PMPCFG3_R15_A_LSB, 27
.equ	RVCSR_PMPCFG3_R15_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG3_R15_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG3_R15_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R15_R
# Description : Read permission for region 15. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R15_R_RESET, 0x0
.equ	RVCSR_PMPCFG3_R15_R_BITS, 0x04000000
.equ	RVCSR_PMPCFG3_R15_R_MSB, 26
.equ	RVCSR_PMPCFG3_R15_R_LSB, 26
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R15_W
# Description : Write permission for region 15
.equ	RVCSR_PMPCFG3_R15_W_RESET, 0x0
.equ	RVCSR_PMPCFG3_R15_W_BITS, 0x02000000
.equ	RVCSR_PMPCFG3_R15_W_MSB, 25
.equ	RVCSR_PMPCFG3_R15_W_LSB, 25
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R15_X
# Description : Execute permission for region 15. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R15_X_RESET, 0x0
.equ	RVCSR_PMPCFG3_R15_X_BITS, 0x01000000
.equ	RVCSR_PMPCFG3_R15_X_MSB, 24
.equ	RVCSR_PMPCFG3_R15_X_LSB, 24
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R14_L
# Description : Lock region 14, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG3_R14_L_RESET, 0x0
.equ	RVCSR_PMPCFG3_R14_L_BITS, 0x00800000
.equ	RVCSR_PMPCFG3_R14_L_MSB, 23
.equ	RVCSR_PMPCFG3_R14_L_LSB, 23
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R14_A
# Description : Address matching type for region 14. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG3_R14_A_RESET, 0x0
.equ	RVCSR_PMPCFG3_R14_A_BITS, 0x00180000
.equ	RVCSR_PMPCFG3_R14_A_MSB, 20
.equ	RVCSR_PMPCFG3_R14_A_LSB, 19
.equ	RVCSR_PMPCFG3_R14_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG3_R14_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG3_R14_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R14_R
# Description : Read permission for region 14. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R14_R_RESET, 0x0
.equ	RVCSR_PMPCFG3_R14_R_BITS, 0x00040000
.equ	RVCSR_PMPCFG3_R14_R_MSB, 18
.equ	RVCSR_PMPCFG3_R14_R_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R14_W
# Description : Write permission for region 14
.equ	RVCSR_PMPCFG3_R14_W_RESET, 0x0
.equ	RVCSR_PMPCFG3_R14_W_BITS, 0x00020000
.equ	RVCSR_PMPCFG3_R14_W_MSB, 17
.equ	RVCSR_PMPCFG3_R14_W_LSB, 17
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R14_X
# Description : Execute permission for region 14. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R14_X_RESET, 0x0
.equ	RVCSR_PMPCFG3_R14_X_BITS, 0x00010000
.equ	RVCSR_PMPCFG3_R14_X_MSB, 16
.equ	RVCSR_PMPCFG3_R14_X_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R13_L
# Description : Lock region 13, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG3_R13_L_RESET, 0x0
.equ	RVCSR_PMPCFG3_R13_L_BITS, 0x00008000
.equ	RVCSR_PMPCFG3_R13_L_MSB, 15
.equ	RVCSR_PMPCFG3_R13_L_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R13_A
# Description : Address matching type for region 13. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG3_R13_A_RESET, 0x0
.equ	RVCSR_PMPCFG3_R13_A_BITS, 0x00001800
.equ	RVCSR_PMPCFG3_R13_A_MSB, 12
.equ	RVCSR_PMPCFG3_R13_A_LSB, 11
.equ	RVCSR_PMPCFG3_R13_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG3_R13_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG3_R13_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R13_R
# Description : Read permission for region 13. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R13_R_RESET, 0x0
.equ	RVCSR_PMPCFG3_R13_R_BITS, 0x00000400
.equ	RVCSR_PMPCFG3_R13_R_MSB, 10
.equ	RVCSR_PMPCFG3_R13_R_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R13_W
# Description : Write permission for region 13
.equ	RVCSR_PMPCFG3_R13_W_RESET, 0x0
.equ	RVCSR_PMPCFG3_R13_W_BITS, 0x00000200
.equ	RVCSR_PMPCFG3_R13_W_MSB, 9
.equ	RVCSR_PMPCFG3_R13_W_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R13_X
# Description : Execute permission for region 13. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R13_X_RESET, 0x0
.equ	RVCSR_PMPCFG3_R13_X_BITS, 0x00000100
.equ	RVCSR_PMPCFG3_R13_X_MSB, 8
.equ	RVCSR_PMPCFG3_R13_X_LSB, 8
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R12_L
# Description : Lock region 12, and apply it to M-mode as well as U-mode.
.equ	RVCSR_PMPCFG3_R12_L_RESET, 0x0
.equ	RVCSR_PMPCFG3_R12_L_BITS, 0x00000080
.equ	RVCSR_PMPCFG3_R12_L_MSB, 7
.equ	RVCSR_PMPCFG3_R12_L_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R12_A
# Description : Address matching type for region 12. Writing an unsupported
#               value (TOR) will set the region to OFF.
#               0x0 -> Disable region
#               0x2 -> Naturally aligned 4-byte
#               0x3 -> Naturally aligned power-of-two (8 bytes to 4 GiB)
.equ	RVCSR_PMPCFG3_R12_A_RESET, 0x0
.equ	RVCSR_PMPCFG3_R12_A_BITS, 0x00000018
.equ	RVCSR_PMPCFG3_R12_A_MSB, 4
.equ	RVCSR_PMPCFG3_R12_A_LSB, 3
.equ	RVCSR_PMPCFG3_R12_A_VALUE_OFF, 0x0
.equ	RVCSR_PMPCFG3_R12_A_VALUE_NA4, 0x2
.equ	RVCSR_PMPCFG3_R12_A_VALUE_NAPOT, 0x3
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R12_R
# Description : Read permission for region 12. Note R and X are transposed from
#               the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R12_R_RESET, 0x0
.equ	RVCSR_PMPCFG3_R12_R_BITS, 0x00000004
.equ	RVCSR_PMPCFG3_R12_R_MSB, 2
.equ	RVCSR_PMPCFG3_R12_R_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R12_W
# Description : Write permission for region 12
.equ	RVCSR_PMPCFG3_R12_W_RESET, 0x0
.equ	RVCSR_PMPCFG3_R12_W_BITS, 0x00000002
.equ	RVCSR_PMPCFG3_R12_W_MSB, 1
.equ	RVCSR_PMPCFG3_R12_W_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_PMPCFG3_R12_X
# Description : Execute permission for region 12. Note R and X are transposed
#               from the standard bit order due to erratum RP2350-E6.
.equ	RVCSR_PMPCFG3_R12_X_RESET, 0x0
.equ	RVCSR_PMPCFG3_R12_X_BITS, 0x00000001
.equ	RVCSR_PMPCFG3_R12_X_MSB, 0
.equ	RVCSR_PMPCFG3_R12_X_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR0
# Description : Physical memory protection address for region 0. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR0_OFFSET, 0x000003b0
.equ	RVCSR_PMPADDR0_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR0_RESET, 0x00000000
.equ	RVCSR_PMPADDR0_MSB, 29
.equ	RVCSR_PMPADDR0_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR1
# Description : Physical memory protection address for region 1. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR1_OFFSET, 0x000003b1
.equ	RVCSR_PMPADDR1_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR1_RESET, 0x00000000
.equ	RVCSR_PMPADDR1_MSB, 29
.equ	RVCSR_PMPADDR1_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR2
# Description : Physical memory protection address for region 2. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR2_OFFSET, 0x000003b2
.equ	RVCSR_PMPADDR2_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR2_RESET, 0x00000000
.equ	RVCSR_PMPADDR2_MSB, 29
.equ	RVCSR_PMPADDR2_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR3
# Description : Physical memory protection address for region 3. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR3_OFFSET, 0x000003b3
.equ	RVCSR_PMPADDR3_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR3_RESET, 0x00000000
.equ	RVCSR_PMPADDR3_MSB, 29
.equ	RVCSR_PMPADDR3_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR4
# Description : Physical memory protection address for region 4. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR4_OFFSET, 0x000003b4
.equ	RVCSR_PMPADDR4_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR4_RESET, 0x00000000
.equ	RVCSR_PMPADDR4_MSB, 29
.equ	RVCSR_PMPADDR4_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR5
# Description : Physical memory protection address for region 5. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR5_OFFSET, 0x000003b5
.equ	RVCSR_PMPADDR5_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR5_RESET, 0x00000000
.equ	RVCSR_PMPADDR5_MSB, 29
.equ	RVCSR_PMPADDR5_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR6
# Description : Physical memory protection address for region 6. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR6_OFFSET, 0x000003b6
.equ	RVCSR_PMPADDR6_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR6_RESET, 0x00000000
.equ	RVCSR_PMPADDR6_MSB, 29
.equ	RVCSR_PMPADDR6_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR7
# Description : Physical memory protection address for region 7. Note all PMP
#               addresses are in units of four bytes.
.equ	RVCSR_PMPADDR7_OFFSET, 0x000003b7
.equ	RVCSR_PMPADDR7_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR7_RESET, 0x00000000
.equ	RVCSR_PMPADDR7_MSB, 29
.equ	RVCSR_PMPADDR7_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR8
# Description : Physical memory protection address for region 8. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to the address range `0x00000000` through
#               `0x0fffffff`, which contains the boot ROM. This range is made
#               accessible to User mode by default. User mode access to this
#               range can be disabled using one of the dynamically configurable
#               PMP regions, or using the permission registers in ACCESSCTRL.
.equ	RVCSR_PMPADDR8_OFFSET, 0x000003b8
.equ	RVCSR_PMPADDR8_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR8_RESET, 0x01ffffff
.equ	RVCSR_PMPADDR8_MSB, 29
.equ	RVCSR_PMPADDR8_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR9
