konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
# Description : Physical memory protection address for region 9. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to the address range `0x40000000` through
#               `0x5fffffff`, which contains the system peripherals. This range
#               is made accessible to User mode by default. User mode access to
#               this range can be disabled using one of the dynamically
#               configurable PMP regions, or using the permission registers in
#               ACCESSCTRL.
.equ	RVCSR_PMPADDR9_OFFSET, 0x000003b9
.equ	RVCSR_PMPADDR9_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR9_RESET, 0x13ffffff
.equ	RVCSR_PMPADDR9_MSB, 29
.equ	RVCSR_PMPADDR9_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR10
# Description : Physical memory protection address for region 10. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to the address range `0xd0000000` through
#               `0xdfffffff`, which contains the core-local peripherals (SIO).
#               This range is made accessible to User mode by default. User
#               mode access to this range can be disabled using one of the
#               dynamically configurable PMP regions, or using the permission
#               registers in ACCESSCTRL.
.equ	RVCSR_PMPADDR10_OFFSET, 0x000003ba
.equ	RVCSR_PMPADDR10_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR10_RESET, 0x35ffffff
.equ	RVCSR_PMPADDR10_MSB, 29
.equ	RVCSR_PMPADDR10_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR11
# Description : Physical memory protection address for region 11. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to all-zeroes. This region is not implemented.
.equ	RVCSR_PMPADDR11_OFFSET, 0x000003bb
.equ	RVCSR_PMPADDR11_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR11_RESET, 0x00000000
.equ	RVCSR_PMPADDR11_MSB, 29
.equ	RVCSR_PMPADDR11_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR12
# Description : Physical memory protection address for region 12. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to all-zeroes. This region is not implemented.
.equ	RVCSR_PMPADDR12_OFFSET, 0x000003bc
.equ	RVCSR_PMPADDR12_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR12_RESET, 0x00000000
.equ	RVCSR_PMPADDR12_MSB, 29
.equ	RVCSR_PMPADDR12_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR13
# Description : Physical memory protection address for region 13. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to all-zeroes. This region is not implemented.
.equ	RVCSR_PMPADDR13_OFFSET, 0x000003bd
.equ	RVCSR_PMPADDR13_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR13_RESET, 0x00000000
.equ	RVCSR_PMPADDR13_MSB, 29
.equ	RVCSR_PMPADDR13_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR14
# Description : Physical memory protection address for region 14. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to all-zeroes. This region is not implemented.
.equ	RVCSR_PMPADDR14_OFFSET, 0x000003be
.equ	RVCSR_PMPADDR14_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR14_RESET, 0x00000000
.equ	RVCSR_PMPADDR14_MSB, 29
.equ	RVCSR_PMPADDR14_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPADDR15
# Description : Physical memory protection address for region 15. Note all PMP
#               addresses are in units of four bytes.
#
#               Hardwired to all-zeroes. This region is not implemented.
.equ	RVCSR_PMPADDR15_OFFSET, 0x000003bf
.equ	RVCSR_PMPADDR15_BITS, 0x3fffffff
.equ	RVCSR_PMPADDR15_RESET, 0x00000000
.equ	RVCSR_PMPADDR15_MSB, 29
.equ	RVCSR_PMPADDR15_LSB, 0
# =============================================================================
# Register    : RVCSR_TSELECT
# Description : Select trigger to be configured via `tdata1`/`tdata2`
#
#               On RP2350, four instruction address triggers are implemented,
#               so only the two LSBs of this register are writable.
.equ	RVCSR_TSELECT_OFFSET, 0x000007a0
.equ	RVCSR_TSELECT_BITS, 0x00000003
.equ	RVCSR_TSELECT_RESET, 0x00000000
.equ	RVCSR_TSELECT_MSB, 1
.equ	RVCSR_TSELECT_LSB, 0
# =============================================================================
# Register    : RVCSR_TDATA1
# Description : Trigger configuration data 1
#
#               Hazard 3 only supports address/data match triggers (type=2) so
#               this register description includes the `mcontrol` fields for
#               this type.
#
#               More precisely, Hazard3 only supports exact instruction address
#               match triggers (hardware breakpoints) so many of this
#               register's fields are hardwired.
.equ	RVCSR_TDATA1_OFFSET, 0x000007a1
.equ	RVCSR_TDATA1_BITS, 0xffffffcf
.equ	RVCSR_TDATA1_RESET, 0x20000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_TYPE
# Description : Trigger type. Hardwired to type=2, meaning an address/data
#               match trigger
.equ	RVCSR_TDATA1_TYPE_RESET, 0x2
.equ	RVCSR_TDATA1_TYPE_BITS, 0xf0000000
.equ	RVCSR_TDATA1_TYPE_MSB, 31
.equ	RVCSR_TDATA1_TYPE_LSB, 28
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_DMODE
# Description : If 0, both Debug and M-mode can write the `tdata` registers at
#               the selected `tselect`.
#
#               If 1, only Debug Mode can write the `tdata` registers at the
#               selected `tselect`. Writes from other modes are ignored.
#
#               This bit is only writable from Debug Mode
.equ	RVCSR_TDATA1_DMODE_RESET, 0x0
.equ	RVCSR_TDATA1_DMODE_BITS, 0x08000000
.equ	RVCSR_TDATA1_DMODE_MSB, 27
.equ	RVCSR_TDATA1_DMODE_LSB, 27
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_MASKMAX
# Description : Value of 0 indicates only exact address matches are supported
.equ	RVCSR_TDATA1_MASKMAX_RESET, 0x00
.equ	RVCSR_TDATA1_MASKMAX_BITS, 0x07e00000
.equ	RVCSR_TDATA1_MASKMAX_MSB, 26
.equ	RVCSR_TDATA1_MASKMAX_LSB, 21
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_HIT
# Description : Trigger hit flag. Not implemented, hardwired to 0.
.equ	RVCSR_TDATA1_HIT_RESET, 0x0
.equ	RVCSR_TDATA1_HIT_BITS, 0x00100000
.equ	RVCSR_TDATA1_HIT_MSB, 20
.equ	RVCSR_TDATA1_HIT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_SELECT
# Description : Hardwired value of 0 indicates that only address matches are
#               supported, not data matches
.equ	RVCSR_TDATA1_SELECT_RESET, 0x0
.equ	RVCSR_TDATA1_SELECT_BITS, 0x00080000
.equ	RVCSR_TDATA1_SELECT_MSB, 19
.equ	RVCSR_TDATA1_SELECT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_TIMING
# Description : Hardwired value of 0 indicates that trigger fires before the
#               triggering instruction executes, not afterward
.equ	RVCSR_TDATA1_TIMING_RESET, 0x0
.equ	RVCSR_TDATA1_TIMING_BITS, 0x00040000
.equ	RVCSR_TDATA1_TIMING_MSB, 18
.equ	RVCSR_TDATA1_TIMING_LSB, 18
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_SIZELO
# Description : Hardwired value of 0 indicates that access size matching is not
#               supported
.equ	RVCSR_TDATA1_SIZELO_RESET, 0x0
.equ	RVCSR_TDATA1_SIZELO_BITS, 0x00030000
.equ	RVCSR_TDATA1_SIZELO_MSB, 17
.equ	RVCSR_TDATA1_SIZELO_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_ACTION
# Description : Select action to be taken when the trigger fires.
#               0x0 -> Raise a breakpoint exception, which can be handled by the M-mode exception handler
#               0x1 -> Enter debug mode. This action is only selectable when `tdata1.dmode` is 1.
.equ	RVCSR_TDATA1_ACTION_RESET, 0x0
.equ	RVCSR_TDATA1_ACTION_BITS, 0x0000f000
.equ	RVCSR_TDATA1_ACTION_MSB, 15
.equ	RVCSR_TDATA1_ACTION_LSB, 12
.equ	RVCSR_TDATA1_ACTION_VALUE_EBREAK, 0x0
.equ	RVCSR_TDATA1_ACTION_VALUE_DEBUG, 0x1
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_CHAIN
# Description : Hardwired to 0 to indicate trigger chaining is not supported.
.equ	RVCSR_TDATA1_CHAIN_RESET, 0x0
.equ	RVCSR_TDATA1_CHAIN_BITS, 0x00000800
.equ	RVCSR_TDATA1_CHAIN_MSB, 11
.equ	RVCSR_TDATA1_CHAIN_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_MATCH
# Description : Hardwired to 0 to indicate match is always on the full address
#               specified by `tdata2`
.equ	RVCSR_TDATA1_MATCH_RESET, 0x0
.equ	RVCSR_TDATA1_MATCH_BITS, 0x00000780
.equ	RVCSR_TDATA1_MATCH_MSB, 10
.equ	RVCSR_TDATA1_MATCH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_M
# Description : When set, enable this trigger in M-mode
.equ	RVCSR_TDATA1_M_RESET, 0x0
.equ	RVCSR_TDATA1_M_BITS, 0x00000040
.equ	RVCSR_TDATA1_M_MSB, 6
.equ	RVCSR_TDATA1_M_LSB, 6
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_U
# Description : When set, enable this trigger in U-mode
.equ	RVCSR_TDATA1_U_RESET, 0x0
.equ	RVCSR_TDATA1_U_BITS, 0x00000008
.equ	RVCSR_TDATA1_U_MSB, 3
.equ	RVCSR_TDATA1_U_LSB, 3
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_EXECUTE
# Description : When set, the trigger fires on the address of an instruction
#               that is executed.
.equ	RVCSR_TDATA1_EXECUTE_RESET, 0x0
.equ	RVCSR_TDATA1_EXECUTE_BITS, 0x00000004
.equ	RVCSR_TDATA1_EXECUTE_MSB, 2
.equ	RVCSR_TDATA1_EXECUTE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_STORE
# Description : Hardwired to 0 to indicate store address/data triggers are not
#               supported
.equ	RVCSR_TDATA1_STORE_RESET, 0x0
.equ	RVCSR_TDATA1_STORE_BITS, 0x00000002
.equ	RVCSR_TDATA1_STORE_MSB, 1
.equ	RVCSR_TDATA1_STORE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_TDATA1_LOAD
# Description : Hardwired to 0 to indicate load address/data triggers are not
#               supported
.equ	RVCSR_TDATA1_LOAD_RESET, 0x0
.equ	RVCSR_TDATA1_LOAD_BITS, 0x00000001
.equ	RVCSR_TDATA1_LOAD_MSB, 0
.equ	RVCSR_TDATA1_LOAD_LSB, 0
# =============================================================================
# Register    : RVCSR_TDATA2
# Description : Trigger configuration data 2
#
#               Contains the address for instruction address triggers (hardware
#               breakpoints)
.equ	RVCSR_TDATA2_OFFSET, 0x000007a2
.equ	RVCSR_TDATA2_BITS, 0xffffffff
.equ	RVCSR_TDATA2_RESET, 0x00000000
.equ	RVCSR_TDATA2_MSB, 31
.equ	RVCSR_TDATA2_LSB, 0
# =============================================================================
# Register    : RVCSR_DCSR
# Description : Debug control and status register. Access outside of Debug Mode
#               will cause an illegal instruction exception.
.equ	RVCSR_DCSR_OFFSET, 0x000007b0
.equ	RVCSR_DCSR_BITS, 0xf0009fc7
.equ	RVCSR_DCSR_RESET, 0x40000603
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_XDEBUGVER
# Description : Hardwired to 4: external debug support as per RISC-V 0.13.2
#               debug specification.
.equ	RVCSR_DCSR_XDEBUGVER_RESET, 0x4
.equ	RVCSR_DCSR_XDEBUGVER_BITS, 0xf0000000
.equ	RVCSR_DCSR_XDEBUGVER_MSB, 31
.equ	RVCSR_DCSR_XDEBUGVER_LSB, 28
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_EBREAKM
# Description : When 1, `ebreak` instructions executed in M-mode will break to
#               Debug Mode instead of trapping
.equ	RVCSR_DCSR_EBREAKM_RESET, 0x0
.equ	RVCSR_DCSR_EBREAKM_BITS, 0x00008000
.equ	RVCSR_DCSR_EBREAKM_MSB, 15
.equ	RVCSR_DCSR_EBREAKM_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_EBREAKU
# Description : When 1, `ebreak` instructions executed in U-mode will break to
#               Debug Mode instead of trapping.
.equ	RVCSR_DCSR_EBREAKU_RESET, 0x0
.equ	RVCSR_DCSR_EBREAKU_BITS, 0x00001000
.equ	RVCSR_DCSR_EBREAKU_MSB, 12
.equ	RVCSR_DCSR_EBREAKU_LSB, 12
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_STEPIE
# Description : Hardwired to 0: no interrupts are taken during hardware single-
#               stepping.
.equ	RVCSR_DCSR_STEPIE_RESET, 0x0
.equ	RVCSR_DCSR_STEPIE_BITS, 0x00000800
.equ	RVCSR_DCSR_STEPIE_MSB, 11
.equ	RVCSR_DCSR_STEPIE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_STOPCOUNT
# Description : Hardwired to 1: `mcycle`/`mcycleh` and `minstret`/`minstreth`
#               do not increment in Debug Mode.
.equ	RVCSR_DCSR_STOPCOUNT_RESET, 0x1
.equ	RVCSR_DCSR_STOPCOUNT_BITS, 0x00000400
.equ	RVCSR_DCSR_STOPCOUNT_MSB, 10
.equ	RVCSR_DCSR_STOPCOUNT_LSB, 10
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_STOPTIME
# Description : Hardwired to 1: core-local timers don't increment in debug
#               mode. External timers (e.g. hart-shared) may be configured to
#               ignore this.
.equ	RVCSR_DCSR_STOPTIME_RESET, 0x1
.equ	RVCSR_DCSR_STOPTIME_BITS, 0x00000200
.equ	RVCSR_DCSR_STOPTIME_MSB, 9
.equ	RVCSR_DCSR_STOPTIME_LSB, 9
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_CAUSE
# Description : Set by hardware when entering debug mode.
#               0x1 -> An ebreak instruction was executed when the relevant `dcsr.ebreakx` bit was set.
#               0x2 -> The trigger module caused a breakpoint exception.
#               0x3 -> Processor entered Debug Mode due to a halt request, or a reset-halt request present when the core reset was released.
#               0x4 -> Processor entered Debug Mode after executing one instruction with single-stepping enabled.
.equ	RVCSR_DCSR_CAUSE_RESET, 0x0
.equ	RVCSR_DCSR_CAUSE_BITS, 0x000001c0
.equ	RVCSR_DCSR_CAUSE_MSB, 8
.equ	RVCSR_DCSR_CAUSE_LSB, 6
.equ	RVCSR_DCSR_CAUSE_VALUE_EBREAK, 0x1
.equ	RVCSR_DCSR_CAUSE_VALUE_TRIGGER, 0x2
.equ	RVCSR_DCSR_CAUSE_VALUE_HALTREQ, 0x3
.equ	RVCSR_DCSR_CAUSE_VALUE_STEP, 0x4
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_STEP
# Description : When 1, re-enter Debug Mode after each instruction executed in
#               M-mode or U-mode.
.equ	RVCSR_DCSR_STEP_RESET, 0x0
.equ	RVCSR_DCSR_STEP_BITS, 0x00000004
.equ	RVCSR_DCSR_STEP_MSB, 2
.equ	RVCSR_DCSR_STEP_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_DCSR_PRV
# Description : Read the privilege mode the core was in when entering Debug
#               Mode, and set the privilege mode the core will execute in when
#               returning from Debug Mode.
.equ	RVCSR_DCSR_PRV_RESET, 0x3
.equ	RVCSR_DCSR_PRV_BITS, 0x00000003
.equ	RVCSR_DCSR_PRV_MSB, 1
.equ	RVCSR_DCSR_PRV_LSB, 0
# =============================================================================
# Register    : RVCSR_DPC
# Description : Debug program counter. When entering Debug Mode, `dpc` samples
#               the current program counter, e.g. the address of an `ebreak`
#               which caused Debug Mode entry. When leaving debug mode, the
#               processor jumps to `dpc`. The host may read/write this register
#               whilst in Debug Mode.
.equ	RVCSR_DPC_OFFSET, 0x000007b1
.equ	RVCSR_DPC_BITS, 0xfffffffe
.equ	RVCSR_DPC_RESET, 0x00000000
.equ	RVCSR_DPC_MSB, 31
.equ	RVCSR_DPC_LSB, 1
# =============================================================================
# Register    : RVCSR_MCYCLE
# Description : Machine-mode cycle counter, low half
#               Counts up once per cycle, when `mcountinhibit.cy` is 0.
#               Disabled by default to save power.
.equ	RVCSR_MCYCLE_OFFSET, 0x00000b00
.equ	RVCSR_MCYCLE_BITS, 0xffffffff
.equ	RVCSR_MCYCLE_RESET, 0x00000000
.equ	RVCSR_MCYCLE_MSB, 31
.equ	RVCSR_MCYCLE_LSB, 0
# =============================================================================
# Register    : RVCSR_MINSTRET
# Description : Machine-mode instruction retire counter, low half
#               Counts up once per instruction, when `mcountinhibit.ir` is 0.
#               Disabled by default to save power.
.equ	RVCSR_MINSTRET_OFFSET, 0x00000b02
.equ	RVCSR_MINSTRET_BITS, 0xffffffff
.equ	RVCSR_MINSTRET_RESET, 0x00000000
.equ	RVCSR_MINSTRET_MSB, 31
.equ	RVCSR_MINSTRET_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER3
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER3_OFFSET, 0x00000b03
.equ	RVCSR_MHPMCOUNTER3_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER3_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER3_MSB, 31
.equ	RVCSR_MHPMCOUNTER3_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER4
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER4_OFFSET, 0x00000b04
.equ	RVCSR_MHPMCOUNTER4_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER4_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER4_MSB, 31
.equ	RVCSR_MHPMCOUNTER4_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER5
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER5_OFFSET, 0x00000b05
.equ	RVCSR_MHPMCOUNTER5_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER5_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER5_MSB, 31
.equ	RVCSR_MHPMCOUNTER5_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER6
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER6_OFFSET, 0x00000b06
.equ	RVCSR_MHPMCOUNTER6_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER6_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER6_MSB, 31
.equ	RVCSR_MHPMCOUNTER6_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER7
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER7_OFFSET, 0x00000b07
.equ	RVCSR_MHPMCOUNTER7_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER7_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER7_MSB, 31
.equ	RVCSR_MHPMCOUNTER7_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER8
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER8_OFFSET, 0x00000b08
.equ	RVCSR_MHPMCOUNTER8_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER8_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER8_MSB, 31
.equ	RVCSR_MHPMCOUNTER8_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER9
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER9_OFFSET, 0x00000b09
.equ	RVCSR_MHPMCOUNTER9_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER9_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER9_MSB, 31
.equ	RVCSR_MHPMCOUNTER9_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER10
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER10_OFFSET, 0x00000b0a
.equ	RVCSR_MHPMCOUNTER10_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER10_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER10_MSB, 31
.equ	RVCSR_MHPMCOUNTER10_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER11
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER11_OFFSET, 0x00000b0b
.equ	RVCSR_MHPMCOUNTER11_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER11_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER11_MSB, 31
.equ	RVCSR_MHPMCOUNTER11_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER12
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER12_OFFSET, 0x00000b0c
.equ	RVCSR_MHPMCOUNTER12_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER12_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER12_MSB, 31
.equ	RVCSR_MHPMCOUNTER12_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER13
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER13_OFFSET, 0x00000b0d
.equ	RVCSR_MHPMCOUNTER13_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER13_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER13_MSB, 31
.equ	RVCSR_MHPMCOUNTER13_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER14
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER14_OFFSET, 0x00000b0e
.equ	RVCSR_MHPMCOUNTER14_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER14_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER14_MSB, 31
.equ	RVCSR_MHPMCOUNTER14_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER15
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER15_OFFSET, 0x00000b0f
.equ	RVCSR_MHPMCOUNTER15_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER15_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER15_MSB, 31
.equ	RVCSR_MHPMCOUNTER15_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER16
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER16_OFFSET, 0x00000b10
.equ	RVCSR_MHPMCOUNTER16_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER16_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER16_MSB, 31
.equ	RVCSR_MHPMCOUNTER16_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER17
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER17_OFFSET, 0x00000b11
.equ	RVCSR_MHPMCOUNTER17_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER17_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER17_MSB, 31
.equ	RVCSR_MHPMCOUNTER17_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER18
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER18_OFFSET, 0x00000b12
.equ	RVCSR_MHPMCOUNTER18_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER18_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER18_MSB, 31
.equ	RVCSR_MHPMCOUNTER18_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER19
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER19_OFFSET, 0x00000b13
.equ	RVCSR_MHPMCOUNTER19_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER19_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER19_MSB, 31
.equ	RVCSR_MHPMCOUNTER19_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER20
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER20_OFFSET, 0x00000b14
.equ	RVCSR_MHPMCOUNTER20_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER20_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER20_MSB, 31
.equ	RVCSR_MHPMCOUNTER20_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER21
