konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER21_OFFSET, 0x00000b15
.equ	RVCSR_MHPMCOUNTER21_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER21_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER21_MSB, 31
.equ	RVCSR_MHPMCOUNTER21_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER22
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER22_OFFSET, 0x00000b16
.equ	RVCSR_MHPMCOUNTER22_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER22_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER22_MSB, 31
.equ	RVCSR_MHPMCOUNTER22_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER23
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER23_OFFSET, 0x00000b17
.equ	RVCSR_MHPMCOUNTER23_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER23_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER23_MSB, 31
.equ	RVCSR_MHPMCOUNTER23_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER24
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER24_OFFSET, 0x00000b18
.equ	RVCSR_MHPMCOUNTER24_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER24_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER24_MSB, 31
.equ	RVCSR_MHPMCOUNTER24_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER25
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER25_OFFSET, 0x00000b19
.equ	RVCSR_MHPMCOUNTER25_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER25_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER25_MSB, 31
.equ	RVCSR_MHPMCOUNTER25_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER26
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER26_OFFSET, 0x00000b1a
.equ	RVCSR_MHPMCOUNTER26_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER26_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER26_MSB, 31
.equ	RVCSR_MHPMCOUNTER26_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER27
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER27_OFFSET, 0x00000b1b
.equ	RVCSR_MHPMCOUNTER27_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER27_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER27_MSB, 31
.equ	RVCSR_MHPMCOUNTER27_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER28
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER28_OFFSET, 0x00000b1c
.equ	RVCSR_MHPMCOUNTER28_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER28_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER28_MSB, 31
.equ	RVCSR_MHPMCOUNTER28_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER29
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER29_OFFSET, 0x00000b1d
.equ	RVCSR_MHPMCOUNTER29_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER29_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER29_MSB, 31
.equ	RVCSR_MHPMCOUNTER29_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER30
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER30_OFFSET, 0x00000b1e
.equ	RVCSR_MHPMCOUNTER30_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER30_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER30_MSB, 31
.equ	RVCSR_MHPMCOUNTER30_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER31
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER31_OFFSET, 0x00000b1f
.equ	RVCSR_MHPMCOUNTER31_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER31_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER31_MSB, 31
.equ	RVCSR_MHPMCOUNTER31_LSB, 0
# =============================================================================
# Register    : RVCSR_MCYCLEH
# Description : Machine-mode cycle counter, high half
#               Counts up once per 1 << 32 cycles, when `mcountinhibit.cy` is
#               0. Disabled by default to save power.
.equ	RVCSR_MCYCLEH_OFFSET, 0x00000b80
.equ	RVCSR_MCYCLEH_BITS, 0xffffffff
.equ	RVCSR_MCYCLEH_RESET, 0x00000000
.equ	RVCSR_MCYCLEH_MSB, 31
.equ	RVCSR_MCYCLEH_LSB, 0
# =============================================================================
# Register    : RVCSR_MINSTRETH
# Description : Machine-mode instruction retire counter, low half
#               Counts up once per 1 << 32 instructions, when
#               `mcountinhibit.ir` is 0. Disabled by default to save power.
.equ	RVCSR_MINSTRETH_OFFSET, 0x00000b82
.equ	RVCSR_MINSTRETH_BITS, 0xffffffff
.equ	RVCSR_MINSTRETH_RESET, 0x00000000
.equ	RVCSR_MINSTRETH_MSB, 31
.equ	RVCSR_MINSTRETH_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER3H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER3H_OFFSET, 0x00000b83
.equ	RVCSR_MHPMCOUNTER3H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER3H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER3H_MSB, 31
.equ	RVCSR_MHPMCOUNTER3H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER4H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER4H_OFFSET, 0x00000b84
.equ	RVCSR_MHPMCOUNTER4H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER4H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER4H_MSB, 31
.equ	RVCSR_MHPMCOUNTER4H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER5H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER5H_OFFSET, 0x00000b85
.equ	RVCSR_MHPMCOUNTER5H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER5H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER5H_MSB, 31
.equ	RVCSR_MHPMCOUNTER5H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER6H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER6H_OFFSET, 0x00000b86
.equ	RVCSR_MHPMCOUNTER6H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER6H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER6H_MSB, 31
.equ	RVCSR_MHPMCOUNTER6H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER7H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER7H_OFFSET, 0x00000b87
.equ	RVCSR_MHPMCOUNTER7H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER7H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER7H_MSB, 31
.equ	RVCSR_MHPMCOUNTER7H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER8H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER8H_OFFSET, 0x00000b88
.equ	RVCSR_MHPMCOUNTER8H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER8H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER8H_MSB, 31
.equ	RVCSR_MHPMCOUNTER8H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER9H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER9H_OFFSET, 0x00000b89
.equ	RVCSR_MHPMCOUNTER9H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER9H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER9H_MSB, 31
.equ	RVCSR_MHPMCOUNTER9H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER10H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER10H_OFFSET, 0x00000b8a
.equ	RVCSR_MHPMCOUNTER10H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER10H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER10H_MSB, 31
.equ	RVCSR_MHPMCOUNTER10H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER11H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER11H_OFFSET, 0x00000b8b
.equ	RVCSR_MHPMCOUNTER11H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER11H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER11H_MSB, 31
.equ	RVCSR_MHPMCOUNTER11H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER12H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER12H_OFFSET, 0x00000b8c
.equ	RVCSR_MHPMCOUNTER12H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER12H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER12H_MSB, 31
.equ	RVCSR_MHPMCOUNTER12H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER13H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER13H_OFFSET, 0x00000b8d
.equ	RVCSR_MHPMCOUNTER13H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER13H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER13H_MSB, 31
.equ	RVCSR_MHPMCOUNTER13H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER14H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER14H_OFFSET, 0x00000b8e
.equ	RVCSR_MHPMCOUNTER14H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER14H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER14H_MSB, 31
.equ	RVCSR_MHPMCOUNTER14H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER15H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER15H_OFFSET, 0x00000b8f
.equ	RVCSR_MHPMCOUNTER15H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER15H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER15H_MSB, 31
.equ	RVCSR_MHPMCOUNTER15H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER16H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER16H_OFFSET, 0x00000b90
.equ	RVCSR_MHPMCOUNTER16H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER16H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER16H_MSB, 31
.equ	RVCSR_MHPMCOUNTER16H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER17H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER17H_OFFSET, 0x00000b91
.equ	RVCSR_MHPMCOUNTER17H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER17H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER17H_MSB, 31
.equ	RVCSR_MHPMCOUNTER17H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER18H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER18H_OFFSET, 0x00000b92
.equ	RVCSR_MHPMCOUNTER18H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER18H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER18H_MSB, 31
.equ	RVCSR_MHPMCOUNTER18H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER19H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER19H_OFFSET, 0x00000b93
.equ	RVCSR_MHPMCOUNTER19H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER19H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER19H_MSB, 31
.equ	RVCSR_MHPMCOUNTER19H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER20H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER20H_OFFSET, 0x00000b94
.equ	RVCSR_MHPMCOUNTER20H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER20H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER20H_MSB, 31
.equ	RVCSR_MHPMCOUNTER20H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER21H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER21H_OFFSET, 0x00000b95
.equ	RVCSR_MHPMCOUNTER21H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER21H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER21H_MSB, 31
.equ	RVCSR_MHPMCOUNTER21H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER22H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER22H_OFFSET, 0x00000b96
.equ	RVCSR_MHPMCOUNTER22H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER22H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER22H_MSB, 31
.equ	RVCSR_MHPMCOUNTER22H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER23H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER23H_OFFSET, 0x00000b97
.equ	RVCSR_MHPMCOUNTER23H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER23H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER23H_MSB, 31
.equ	RVCSR_MHPMCOUNTER23H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER24H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER24H_OFFSET, 0x00000b98
.equ	RVCSR_MHPMCOUNTER24H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER24H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER24H_MSB, 31
.equ	RVCSR_MHPMCOUNTER24H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER25H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER25H_OFFSET, 0x00000b99
.equ	RVCSR_MHPMCOUNTER25H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER25H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER25H_MSB, 31
.equ	RVCSR_MHPMCOUNTER25H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER26H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER26H_OFFSET, 0x00000b9a
.equ	RVCSR_MHPMCOUNTER26H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER26H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER26H_MSB, 31
.equ	RVCSR_MHPMCOUNTER26H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER27H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER27H_OFFSET, 0x00000b9b
.equ	RVCSR_MHPMCOUNTER27H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER27H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER27H_MSB, 31
.equ	RVCSR_MHPMCOUNTER27H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER28H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER28H_OFFSET, 0x00000b9c
.equ	RVCSR_MHPMCOUNTER28H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER28H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER28H_MSB, 31
.equ	RVCSR_MHPMCOUNTER28H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER29H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER29H_OFFSET, 0x00000b9d
.equ	RVCSR_MHPMCOUNTER29H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER29H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER29H_MSB, 31
.equ	RVCSR_MHPMCOUNTER29H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER30H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER30H_OFFSET, 0x00000b9e
.equ	RVCSR_MHPMCOUNTER30H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER30H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER30H_MSB, 31
.equ	RVCSR_MHPMCOUNTER30H_LSB, 0
# =============================================================================
# Register    : RVCSR_MHPMCOUNTER31H
# Description : Extended performance counter, hardwired to 0.
.equ	RVCSR_MHPMCOUNTER31H_OFFSET, 0x00000b9f
.equ	RVCSR_MHPMCOUNTER31H_BITS, 0xffffffff
.equ	RVCSR_MHPMCOUNTER31H_RESET, 0x00000000
.equ	RVCSR_MHPMCOUNTER31H_MSB, 31
.equ	RVCSR_MHPMCOUNTER31H_LSB, 0
# =============================================================================
# Register    : RVCSR_PMPCFGM0
# Description : PMP M-mode configuration. One bit per PMP region. Setting a bit
#               makes the corresponding region apply to M-mode (like the
#               `pmpcfg.L` bit) but does not lock the region.
#
#               PMP is useful for non-security-related purposes, such as stack
#               guarding and peripheral emulation. This extension allows M-mode
#               to freely use any currently unlocked regions for its own
#               purposes, without the inconvenience of having to lock them.
#
#               Note that this does not grant any new capabilities to M-mode,
#               since in the base standard it is already possible to apply
#               unlocked regions to M-mode by locking them. In general, PMP
#               regions should be locked in ascending region number order so
#               they can't be subsequently overridden by currently unlocked
#               regions.
#
#               Note also that this is not the same as the rule locking bypass
#               bit in the ePMP extension, which does not permit locked and
#               unlocked M-mode regions to coexist.
#
#               This is a Hazard3 custom CSR.
.equ	RVCSR_PMPCFGM0_OFFSET, 0x00000bd0
.equ	RVCSR_PMPCFGM0_BITS, 0x0000ffff
.equ	RVCSR_PMPCFGM0_RESET, 0x00000000
.equ	RVCSR_PMPCFGM0_MSB, 15
.equ	RVCSR_PMPCFGM0_LSB, 0
# =============================================================================
# Register    : RVCSR_MEIEA
# Description : External interrupt enable array.
#
#               The array contains a read-write bit for each external interrupt
#               request: a `1` bit indicates that interrupt is currently
#               enabled. At reset, all external interrupts are disabled.
#
#               If enabled, an external interrupt can cause assertion of the
#               standard RISC-V machine external interrupt pending flag
#               (`mip.meip`), and therefore cause the processor to enter the
#               external interrupt vector. See `meipa`.
#
#               There are up to 512 external interrupts. The upper half of this
#               register contains a 16-bit window into the full 512-bit vector.
#               The window is indexed by the 5 LSBs of the write data.
.equ	RVCSR_MEIEA_OFFSET, 0x00000be0
.equ	RVCSR_MEIEA_BITS, 0xffff001f
.equ	RVCSR_MEIEA_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIEA_WINDOW
# Description : 16-bit read/write window into the external interrupt enable
#               array
.equ	RVCSR_MEIEA_WINDOW_RESET, 0x0000
.equ	RVCSR_MEIEA_WINDOW_BITS, 0xffff0000
.equ	RVCSR_MEIEA_WINDOW_MSB, 31
.equ	RVCSR_MEIEA_WINDOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIEA_INDEX
# Description : Write-only self-clearing field (no value is stored) used to
#               control which window of the array appears in `window`.
.equ	RVCSR_MEIEA_INDEX_RESET, 0x00
.equ	RVCSR_MEIEA_INDEX_BITS, 0x0000001f
.equ	RVCSR_MEIEA_INDEX_MSB, 4
.equ	RVCSR_MEIEA_INDEX_LSB, 0
# =============================================================================
# Register    : RVCSR_MEIPA
# Description : External interrupt pending array
#
#               Contains a read-only bit for each external interrupt request.
#               Similarly to `meiea`, this register is a window into an array
#               of up to 512 external interrupt flags. The status appears in
#               the upper 16 bits of the value read from `meipa`, and the lower
#               5 bits of the value _written_ by the same CSR instruction (or 0
#               if no write takes place) select a 16-bit window of the full
#               interrupt pending array.
#
#               A `1` bit indicates that interrupt is currently asserted. IRQs
#               are assumed to be level-sensitive, and the relevant `meipa` bit
#               is cleared by servicing the requestor so that it deasserts its
#               interrupt request.
#
#               When any interrupt of sufficient priority is both set in
#               `meipa` and enabled in `meiea`, the standard RISC-V external
#               interrupt pending bit `mip.meip` is asserted. In other words,
#               `meipa` is filtered by `meiea` to generate the standard
#               `mip.meip` flag.
.equ	RVCSR_MEIPA_OFFSET, 0x00000be1
.equ	RVCSR_MEIPA_BITS, 0xffff001f
.equ	RVCSR_MEIPA_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIPA_WINDOW
# Description : 16-bit read-only window into the external interrupt pending
#               array
.equ	RVCSR_MEIPA_WINDOW_BITS, 0xffff0000
.equ	RVCSR_MEIPA_WINDOW_MSB, 31
.equ	RVCSR_MEIPA_WINDOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIPA_INDEX
# Description : Write-only, self-clearing field (no value is stored) used to
#               control which window of the array appears in `window`.
.equ	RVCSR_MEIPA_INDEX_RESET, 0x00
.equ	RVCSR_MEIPA_INDEX_BITS, 0x0000001f
.equ	RVCSR_MEIPA_INDEX_MSB, 4
.equ	RVCSR_MEIPA_INDEX_LSB, 0
# =============================================================================
# Register    : RVCSR_MEIFA
# Description : External interrupt force array
#
#               Contains a read-write bit for every interrupt request. Writing
#               a 1 to a bit in the interrupt force array causes the
#               corresponding bit to become pending in `meipa`. Software can
#               use this feature to manually trigger a particular interrupt.
#
#               There are no restrictions on using `meifa` inside of an
#               interrupt. The more useful case here is to schedule some lower-
#               priority handler from within a high-priority interrupt, so that
#               it will execute before the core returns to the foreground code.
#               Implementers may wish to reserve some external IRQs with their
#               external inputs tied to 0 for this purpose.
#
#               Bits can be cleared by software, and are cleared automatically
#               by hardware upon a read of `meinext` which returns the
#               corresponding IRQ number in `meinext.irq` with `mienext.noirq`
#               clear (no matter whether `meinext.update` is written).
#
#               `meifa` implements the same array window indexing scheme as
#               `meiea` and `meipa`.
.equ	RVCSR_MEIFA_OFFSET, 0x00000be2
.equ	RVCSR_MEIFA_BITS, 0xffff001f
.equ	RVCSR_MEIFA_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIFA_WINDOW
# Description : 16-bit read/write window into the external interrupt force
#               array
.equ	RVCSR_MEIFA_WINDOW_RESET, 0x0000
.equ	RVCSR_MEIFA_WINDOW_BITS, 0xffff0000
.equ	RVCSR_MEIFA_WINDOW_MSB, 31
.equ	RVCSR_MEIFA_WINDOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIFA_INDEX
# Description : Write-only, self-clearing field (no value is stored) used to
#               control which window of the array appears in `window`.
.equ	RVCSR_MEIFA_INDEX_RESET, 0x00
.equ	RVCSR_MEIFA_INDEX_BITS, 0x0000001f
.equ	RVCSR_MEIFA_INDEX_MSB, 4
.equ	RVCSR_MEIFA_INDEX_LSB, 0
# =============================================================================
# Register    : RVCSR_MEIPRA
# Description : External interrupt priority array
#
#               Each interrupt has an (up to) 4-bit priority value associated
#               with it, and each access to this register reads and/or writes a
#               16-bit window containing four such priority values. When less
#               than 16 priority levels are available, the LSBs of the priority
#               fields are hardwired to 0.
#
#               When an interrupt's priority is lower than the current
