konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/rvcsr.inc
#               preemption priority `meicontext.preempt`, it is treated as not
#               being pending for the purposes of `mip.meip`. The pending bit
#               in `meipa` will still assert, but the machine external
#               interrupt pending bit `mip.meip` will not, so the processor
#               will ignore this interrupt. See `meicontext`.
.equ	RVCSR_MEIPRA_OFFSET, 0x00000be3
.equ	RVCSR_MEIPRA_BITS, 0xffff001f
.equ	RVCSR_MEIPRA_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIPRA_WINDOW
# Description : 16-bit read/write window into the external interrupt priority
#               array, containing four 4-bit priority values.
.equ	RVCSR_MEIPRA_WINDOW_RESET, 0x0000
.equ	RVCSR_MEIPRA_WINDOW_BITS, 0xffff0000
.equ	RVCSR_MEIPRA_WINDOW_MSB, 31
.equ	RVCSR_MEIPRA_WINDOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEIPRA_INDEX
# Description : Write-only, self-clearing field (no value is stored) used to
#               control which window of the array appears in `window`.
.equ	RVCSR_MEIPRA_INDEX_RESET, 0x00
.equ	RVCSR_MEIPRA_INDEX_BITS, 0x0000001f
.equ	RVCSR_MEIPRA_INDEX_MSB, 4
.equ	RVCSR_MEIPRA_INDEX_LSB, 0
# =============================================================================
# Register    : RVCSR_MEINEXT
# Description : Get next external interrupt
#
#               Contains the index of the highest-priority external interrupt
#               which is both asserted in `meipa` and enabled in `meiea`, left-
#               shifted by 2 so that it can be used to index an array of 32-bit
#               function pointers. If there is no such interrupt, the MSB is
#               set.
#
#               When multiple interrupts of the same priority are both pending
#               and enabled, the lowest-numbered wins. Interrupts with priority
#               less than `meicontext.ppreempt` -- the _previous_ preemption
#               priority -- are treated as though they are not pending. This is
#               to ensure that a preempting interrupt frame does not service
#               interrupts which may be in progress in the frame that was
#               preempted.
.equ	RVCSR_MEINEXT_OFFSET, 0x00000be4
.equ	RVCSR_MEINEXT_BITS, 0x800007fd
.equ	RVCSR_MEINEXT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEINEXT_NOIRQ
# Description : Set when there is no external interrupt which is enabled,
#               pending, and has priority greater than or equal to
#               `meicontext.ppreempt`. Can be efficiently tested with a `bltz`
#               or `bgez` instruction.
.equ	RVCSR_MEINEXT_NOIRQ_RESET, 0x0
.equ	RVCSR_MEINEXT_NOIRQ_BITS, 0x80000000
.equ	RVCSR_MEINEXT_NOIRQ_MSB, 31
.equ	RVCSR_MEINEXT_NOIRQ_LSB, 31
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEINEXT_IRQ
# Description : Index of the highest-priority active external interrupt. Zero
#               when no external interrupts with sufficient priority are both
#               pending and enabled.
.equ	RVCSR_MEINEXT_IRQ_RESET, 0x000
.equ	RVCSR_MEINEXT_IRQ_BITS, 0x000007fc
.equ	RVCSR_MEINEXT_IRQ_MSB, 10
.equ	RVCSR_MEINEXT_IRQ_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEINEXT_UPDATE
# Description : Writing 1 (self-clearing) causes hardware to update
#               `meicontext` according to the IRQ number and preemption
#               priority of the interrupt indicated in `noirq`/`irq`. This
#               should be done in a single atomic operation, i.e. `csrrsi a0,
#               meinext, 0x1`.
.equ	RVCSR_MEINEXT_UPDATE_RESET, 0x0
.equ	RVCSR_MEINEXT_UPDATE_BITS, 0x00000001
.equ	RVCSR_MEINEXT_UPDATE_MSB, 0
.equ	RVCSR_MEINEXT_UPDATE_LSB, 0
# =============================================================================
# Register    : RVCSR_MEICONTEXT
# Description : External interrupt context register
#
#               Configures the priority level for interrupt preemption, and
#               helps software track which interrupt it is currently in. The
#               latter is useful when a common interrupt service routine
#               handles interrupt requests from multiple instances of the same
#               peripheral.
#
#               A three-level stack of preemption priorities is maintained in
#               the `preempt`, `ppreempt` and `pppreempt` fields. The priority
#               stack is saved when hardware enters the external interrupt
#               vector, and restored by an `mret` instruction if
#               `meicontext.mreteirq` is set.
#
#               The top entry of the priority stack, `preempt`, is used by
#               hardware to ensure that only higher-priority interrupts can
#               preempt the current interrupt. The next entry, `ppreempt`, is
#               used to avoid servicing interrupts which may already be in
#               progress in a frame that was preempted. The third entry,
#               `pppreempt`, has no hardware effect, but ensures that `preempt`
#               and `ppreempt` can be correctly saved/restored across arbitrary
#               levels of preemption.
.equ	RVCSR_MEICONTEXT_OFFSET, 0x00000be5
.equ	RVCSR_MEICONTEXT_BITS, 0xff1f9fff
.equ	RVCSR_MEICONTEXT_RESET, 0x00008000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_PPPREEMPT
# Description : Previous `ppreempt`. Set to `ppreempt` on priority save, set to
#               zero on priority restore.  Has no hardware effect, but ensures
#               that when `meicontext` is saved/restored correctly, `preempt`
#               and `ppreempt` stack correctly through arbitrarily many
#               preemption frames.
.equ	RVCSR_MEICONTEXT_PPPREEMPT_RESET, 0x0
.equ	RVCSR_MEICONTEXT_PPPREEMPT_BITS, 0xf0000000
.equ	RVCSR_MEICONTEXT_PPPREEMPT_MSB, 31
.equ	RVCSR_MEICONTEXT_PPPREEMPT_LSB, 28
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_PPREEMPT
# Description : Previous `preempt`. Set to `preempt` on priority save, restored
#               to to `pppreempt` on priority restore.
#
#               IRQs of lower priority than `ppreempt` are not visible in
#               `meinext`, so that a preemptee is not re-taken in the
#               preempting frame.
.equ	RVCSR_MEICONTEXT_PPREEMPT_RESET, 0x0
.equ	RVCSR_MEICONTEXT_PPREEMPT_BITS, 0x0f000000
.equ	RVCSR_MEICONTEXT_PPREEMPT_MSB, 27
.equ	RVCSR_MEICONTEXT_PPREEMPT_LSB, 24
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_PREEMPT
# Description : Minimum interrupt priority to preempt the current interrupt.
#               Interrupts with lower priority than `preempt` do not cause the
#               core to transfer to an interrupt handler. Updated by hardware
#               when when `meinext.update` is written, or when hardware enters
#               the external interrupt vector.
#
#               If an interrupt is present in `meinext` when this field is
#               updated, then `preempt` is set to one level greater than that
#               interrupt's priority. Otherwise, `ppreempt` is set to one level
#               greater than the maximum interrupt priority, disabling
#               preemption.
.equ	RVCSR_MEICONTEXT_PREEMPT_RESET, 0x00
.equ	RVCSR_MEICONTEXT_PREEMPT_BITS, 0x001f0000
.equ	RVCSR_MEICONTEXT_PREEMPT_MSB, 20
.equ	RVCSR_MEICONTEXT_PREEMPT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_NOIRQ
# Description : Not in interrupt (read/write). Set to 1 at reset. Set to
#               `meinext.noirq` when `meinext.update` is written. No hardware
#               effect.
.equ	RVCSR_MEICONTEXT_NOIRQ_RESET, 0x1
.equ	RVCSR_MEICONTEXT_NOIRQ_BITS, 0x00008000
.equ	RVCSR_MEICONTEXT_NOIRQ_MSB, 15
.equ	RVCSR_MEICONTEXT_NOIRQ_LSB, 15
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_IRQ
# Description : Current IRQ number (read/write). Set to `meinext.irq` when
#               `meinext.update` is written. No hardware effect.
.equ	RVCSR_MEICONTEXT_IRQ_RESET, 0x000
.equ	RVCSR_MEICONTEXT_IRQ_BITS, 0x00001ff0
.equ	RVCSR_MEICONTEXT_IRQ_MSB, 12
.equ	RVCSR_MEICONTEXT_IRQ_LSB, 4
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_MTIESAVE
# Description : Reads as the current value of `mie.mtie`, if `clearts` is set
#               by the same CSR access instruction. Otherwise reads as 0.
#               Writes are ORed into `mie.mtie`.
.equ	RVCSR_MEICONTEXT_MTIESAVE_RESET, 0x0
.equ	RVCSR_MEICONTEXT_MTIESAVE_BITS, 0x00000008
.equ	RVCSR_MEICONTEXT_MTIESAVE_MSB, 3
.equ	RVCSR_MEICONTEXT_MTIESAVE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_MSIESAVE
# Description : Reads as the current value of `mie.msie`, if `clearts` is set
#               by the same CSR access instruction. Otherwise reads as 0.
#               Writes are ORed into `mie.msie`.
.equ	RVCSR_MEICONTEXT_MSIESAVE_RESET, 0x0
.equ	RVCSR_MEICONTEXT_MSIESAVE_BITS, 0x00000004
.equ	RVCSR_MEICONTEXT_MSIESAVE_MSB, 2
.equ	RVCSR_MEICONTEXT_MSIESAVE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_CLEARTS
# Description : Write-1 self-clearing field. Writing 1 will clear `mie.mtie`
#               and `mie.msie`, and present their prior values in the
#               `mtiesave` and `msiesave` of this register. This makes it safe
#               to re-enable IRQs (via `mstatus.mie`) without the possibility
#               of being preempted by the standard timer and soft interrupt
#               handlers, which may not be aware of Hazard3's interrupt
#               hardware.
#
#               The clear due to `clearts` takes precedence over the set due to
#               `mtiesave`/`msiesave`, although it would be unusual for
#               software to write both on the same cycle.
.equ	RVCSR_MEICONTEXT_CLEARTS_RESET, 0x0
.equ	RVCSR_MEICONTEXT_CLEARTS_BITS, 0x00000002
.equ	RVCSR_MEICONTEXT_CLEARTS_MSB, 1
.equ	RVCSR_MEICONTEXT_CLEARTS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_MEICONTEXT_MRETEIRQ
# Description : If 1, enable restore of the preemption priority stack on
#               `mret`. This bit is set on entering the external interrupt
#               vector, cleared by `mret`, and cleared upon taking any trap
#               other than an external interrupt.
#
#               Provided `meicontext` is saved on entry to the external
#               interrupt vector (before enabling preemption), is restored
#               before exiting, and the standard software/timer IRQs are
#               prevented from preempting (e.g. by using `clearts`), this flag
#               allows the hardware to safely manage the preemption priority
#               stack even when an external interrupt handler may take
#               exceptions.
.equ	RVCSR_MEICONTEXT_MRETEIRQ_RESET, 0x0
.equ	RVCSR_MEICONTEXT_MRETEIRQ_BITS, 0x00000001
.equ	RVCSR_MEICONTEXT_MRETEIRQ_MSB, 0
.equ	RVCSR_MEICONTEXT_MRETEIRQ_LSB, 0
# =============================================================================
# Register    : RVCSR_MSLEEP
# Description : M-mode sleep control register
.equ	RVCSR_MSLEEP_OFFSET, 0x00000bf0
.equ	RVCSR_MSLEEP_BITS, 0x00000007
.equ	RVCSR_MSLEEP_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSLEEP_SLEEPONBLOCK
# Description : Enter the deep sleep state configured by
#               msleep.deepsleep/msleep.powerdown on a `h3.block` instruction,
#               as well as a standard `wfi`. If this bit is clear, a `h3.block`
#               is always implemented as a simple pipeline stall.
.equ	RVCSR_MSLEEP_SLEEPONBLOCK_RESET, 0x0
.equ	RVCSR_MSLEEP_SLEEPONBLOCK_BITS, 0x00000004
.equ	RVCSR_MSLEEP_SLEEPONBLOCK_MSB, 2
.equ	RVCSR_MSLEEP_SLEEPONBLOCK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSLEEP_POWERDOWN
# Description : Release the external power request when going to sleep. The
#               function of this is platform-defined -- it may do nothing, it
#               may do something simple like clock-gating the fabric, or it may
#               be tied to some complex system-level power controller.
#
#               When waking, the processor reasserts its external power-up
#               request, and will not fetch any instructions until the request
#               is acknowledged. This may add considerable latency to the
#               wakeup.
.equ	RVCSR_MSLEEP_POWERDOWN_RESET, 0x0
.equ	RVCSR_MSLEEP_POWERDOWN_BITS, 0x00000002
.equ	RVCSR_MSLEEP_POWERDOWN_MSB, 1
.equ	RVCSR_MSLEEP_POWERDOWN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : RVCSR_MSLEEP_DEEPSLEEP
# Description : Deassert the processor clock enable when entering the sleep
#               state. If a clock gate is instantiated, this allows most of the
#               processor (everything except the power state machine and the
#               interrupt and halt input registers) to be clock gated whilst
#               asleep, which may reduce the sleep current. This adds one cycle
#               to the wakeup latency.
.equ	RVCSR_MSLEEP_DEEPSLEEP_RESET, 0x0
.equ	RVCSR_MSLEEP_DEEPSLEEP_BITS, 0x00000001
.equ	RVCSR_MSLEEP_DEEPSLEEP_MSB, 0
.equ	RVCSR_MSLEEP_DEEPSLEEP_LSB, 0
# =============================================================================
# Register    : RVCSR_DMDATA0
# Description : The Debug Module's DATA0 register is mapped into Hazard3's CSR
#               space so that the Debug Module can exchange data with the core
#               by executing CSR access instructions (this is used to implement
#               the Abstract Access Register command). Only accessible in Debug
#               Mode.
.equ	RVCSR_DMDATA0_OFFSET, 0x00000bff
.equ	RVCSR_DMDATA0_BITS, 0xffffffff
.equ	RVCSR_DMDATA0_RESET, 0x00000000
.equ	RVCSR_DMDATA0_MSB, 31
.equ	RVCSR_DMDATA0_LSB, 0
# =============================================================================
# Register    : RVCSR_CYCLE
# Description : Read-only U-mode alias of mcycle, accessible when
#               `mcounteren.cy` is set
.equ	RVCSR_CYCLE_OFFSET, 0x00000c00
.equ	RVCSR_CYCLE_BITS, 0xffffffff
.equ	RVCSR_CYCLE_RESET, 0x00000000
.equ	RVCSR_CYCLE_MSB, 31
.equ	RVCSR_CYCLE_LSB, 0
# =============================================================================
# Register    : RVCSR_INSTRET
# Description : Read-only U-mode alias of minstret, accessible when
#               `mcounteren.ir` is set
.equ	RVCSR_INSTRET_OFFSET, 0x00000c02
.equ	RVCSR_INSTRET_BITS, 0xffffffff
.equ	RVCSR_INSTRET_RESET, 0x00000000
.equ	RVCSR_INSTRET_MSB, 31
.equ	RVCSR_INSTRET_LSB, 0
# =============================================================================
# Register    : RVCSR_CYCLEH
# Description : Read-only U-mode alias of mcycleh, accessible when
#               `mcounteren.cy` is set
.equ	RVCSR_CYCLEH_OFFSET, 0x00000c80
.equ	RVCSR_CYCLEH_BITS, 0xffffffff
.equ	RVCSR_CYCLEH_RESET, 0x00000000
.equ	RVCSR_CYCLEH_MSB, 31
.equ	RVCSR_CYCLEH_LSB, 0
# =============================================================================
# Register    : RVCSR_INSTRETH
# Description : Read-only U-mode alias of minstreth, accessible when
#               `mcounteren.ir` is set
.equ	RVCSR_INSTRETH_OFFSET, 0x00000c82
.equ	RVCSR_INSTRETH_BITS, 0xffffffff
.equ	RVCSR_INSTRETH_RESET, 0x00000000
.equ	RVCSR_INSTRETH_MSB, 31
.equ	RVCSR_INSTRETH_LSB, 0
# =============================================================================
# Register    : RVCSR_MVENDORID
# Description : Vendor ID
.equ	RVCSR_MVENDORID_OFFSET, 0x00000f11
.equ	RVCSR_MVENDORID_BITS, 0xffffffff
.equ	RVCSR_MVENDORID_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : RVCSR_MVENDORID_BANK
.equ	RVCSR_MVENDORID_BANK_BITS, 0xffffff80
.equ	RVCSR_MVENDORID_BANK_MSB, 31
.equ	RVCSR_MVENDORID_BANK_LSB, 7
# -----------------------------------------------------------------------------
# Field       : RVCSR_MVENDORID_OFFSET
.equ	RVCSR_MVENDORID_OFFSET_BITS, 0x0000007f
.equ	RVCSR_MVENDORID_OFFSET_MSB, 6
.equ	RVCSR_MVENDORID_OFFSET_LSB, 0
# =============================================================================
# Register    : RVCSR_MARCHID
# Description : Architecture ID (Hazard3)
.equ	RVCSR_MARCHID_OFFSET, 0x00000f12
.equ	RVCSR_MARCHID_BITS, 0xffffffff
.equ	RVCSR_MARCHID_RESET, 0x0000001b
.equ	RVCSR_MARCHID_MSB, 31
.equ	RVCSR_MARCHID_LSB, 0
# =============================================================================
# Register    : RVCSR_MIMPID
# Description : Implementation ID
.equ	RVCSR_MIMPID_OFFSET, 0x00000f13
.equ	RVCSR_MIMPID_BITS, 0xffffffff
.equ	RVCSR_MIMPID_MSB, 31
.equ	RVCSR_MIMPID_LSB, 0
# =============================================================================
# Register    : RVCSR_MHARTID
# Description : Hardware thread ID
#               On RP2350, core 0 has a hart ID of 0, and core 1 has a hart ID
#               of 1.
.equ	RVCSR_MHARTID_OFFSET, 0x00000f14
.equ	RVCSR_MHARTID_BITS, 0xffffffff
.equ	RVCSR_MHARTID_MSB, 31
.equ	RVCSR_MHARTID_LSB, 0
# =============================================================================
# Register    : RVCSR_MCONFIGPTR
# Description : Pointer to configuration data structure (hardwired to 0)
.equ	RVCSR_MCONFIGPTR_OFFSET, 0x00000f15
.equ	RVCSR_MCONFIGPTR_BITS, 0xffffffff
.equ	RVCSR_MCONFIGPTR_RESET, 0x00000000
.equ	RVCSR_MCONFIGPTR_MSB, 31
.equ	RVCSR_MCONFIGPTR_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_RVCSR_H
